/* automatically generated by rust-bindgen 0.59.1 */

pub const WAIT_TIMEOUT: u32 = 258;
pub const CONNECTION_TYPE_MODEM: u32 = 1;
pub const CONNECTION_TYPE_BROADBAND_LOW: u32 = 2;
pub const CONNECTION_TYPE_SATELLITE: u32 = 3;
pub const CONNECTION_TYPE_BROADBAND_HIGH: u32 = 4;
pub const CONNECTION_TYPE_WAN: u32 = 5;
pub const CONNECTION_TYPE_LAN: u32 = 6;
pub const CONNECTION_TYPE_AUTODETECT: u32 = 7;
pub const RDPDR_DTYP_SERIAL: u32 = 1;
pub const RDPDR_DTYP_PARALLEL: u32 = 2;
pub const RDPDR_DTYP_PRINT: u32 = 4;
pub const RDPDR_DTYP_FILESYSTEM: u32 = 8;
pub const RDPDR_DTYP_SMARTCARD: u32 = 32;
pub const FreeRDP_instance: u32 = 0;
pub const FreeRDP_ServerMode: u32 = 16;
pub const FreeRDP_ShareId: u32 = 17;
pub const FreeRDP_PduSource: u32 = 18;
pub const FreeRDP_ServerPort: u32 = 19;
pub const FreeRDP_ServerHostname: u32 = 20;
pub const FreeRDP_Username: u32 = 21;
pub const FreeRDP_Password: u32 = 22;
pub const FreeRDP_Domain: u32 = 23;
pub const FreeRDP_PasswordHash: u32 = 24;
pub const FreeRDP_WaitForOutputBufferFlush: u32 = 25;
pub const FreeRDP_MaxTimeInCheckLoop: u32 = 26;
pub const FreeRDP_AcceptedCert: u32 = 27;
pub const FreeRDP_AcceptedCertLength: u32 = 28;
pub const FreeRDP_RdpVersion: u32 = 128;
pub const FreeRDP_DesktopWidth: u32 = 129;
pub const FreeRDP_DesktopHeight: u32 = 130;
pub const FreeRDP_ColorDepth: u32 = 131;
pub const FreeRDP_ConnectionType: u32 = 132;
pub const FreeRDP_ClientBuild: u32 = 133;
pub const FreeRDP_ClientHostname: u32 = 134;

#[derive(Debug, Copy, Clone)]
pub struct rdp_rail {
    _unused: [u8; 0],
}
pub type rdpRail = rdp_rail;
pub type rdpCache = rdp_cache;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_channels {
    _unused: [u8; 0],
}
pub type rdpChannels = rdp_channels;
pub type rdpGraphics = rdp_graphics;
pub type rdpMetrics = rdp_metrics;
pub type rdpCodecs = rdp_codecs;
pub type freerdp = rdp_freerdp;
pub type rdpContext = rdp_context;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_freerdp_peer {
    _unused: [u8; 0],
}
pub type freerdp_peer = rdp_freerdp_peer;
pub type RDP_CLIENT_ENTRY_POINTS_V1 = rdp_client_entry_points_v1;
pub type RDP_CLIENT_ENTRY_POINTS = RDP_CLIENT_ENTRY_POINTS_V1;
pub type size_t = ::std::os::raw::c_ulong;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type va_list = __builtin_va_list;
pub type FILE = _IO_FILE;
pub type __uint8 = u8;
pub type __int16 = i16;
pub type __uint16 = u16;
pub type __int32 = i32;
pub type __uint32 = u32;
pub type __int64 = i64;
pub type __uint64 = u64;
pub type PVOID = *mut ::std::os::raw::c_void;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type BOOL = __int32;
pub type PBOOL = *mut BOOL;
pub type LPBOOL = *mut BOOL;
pub type BYTE = __uint8;
pub type LPBYTE = *mut BYTE;
pub type BOOLEAN = BYTE;
pub type CHAR = ::std::os::raw::c_char;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type PCHAR = *mut CHAR;
pub type PSTR = *mut CHAR;
pub type LPSTR = *mut CHAR;
pub type LPCSTR = *const CHAR;
pub type PUCHAR = *mut UCHAR;
pub type WCHAR = __uint16;
pub type LPWSTR = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type LPCWSTR = *const WCHAR;
pub type INT = __int32;
pub type LONG = __int32;
pub type UINT = __uint32;
pub type USHORT = __uint16;
pub type ULONG = __uint32;
pub type PULONG = *mut __uint32;
pub type INT16 = __int16;
pub type INT32 = __int32;
pub type INT64 = __int64;
pub type UINT8 = __uint8;
pub type UINT16 = __uint16;
pub type UINT32 = __uint32;
pub type UINT64 = __uint64;
pub type WORD = __uint16;
pub type DWORD = __uint32;
pub type LPDWORD = *mut __uint32;
pub type UINT_PTR = u64;
pub type LONG_PTR = i64;
pub type ULONG_PTR = u64;
pub type PULONG_PTR = *mut u64;
pub type SIZE_T = ULONG_PTR;
pub type SSIZE_T = LONG_PTR;
pub type FLOAT = f32;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type PHANDLE = *mut ::std::os::raw::c_void;
pub type HINSTANCE = HANDLE;
pub type HWND = HANDLE;
pub type HMENU = HANDLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _POINTL {
    pub x: LONG,
    pub y: LONG,
}
#[test]
fn bindgen_test_layout__POINTL() {
    assert_eq!(
        ::std::mem::size_of::<_POINTL>(),
        8usize,
        concat!("Size of: ", stringify!(_POINTL))
    );
    assert_eq!(
        ::std::mem::align_of::<_POINTL>(),
        4usize,
        concat!("Alignment of ", stringify!(_POINTL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_POINTL>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_POINTL),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_POINTL>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_POINTL),
            "::",
            stringify!(y)
        )
    );
}
pub type POINTL = _POINTL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSIZE {
    pub cx: LONG,
    pub cy: LONG,
}
#[test]
fn bindgen_test_layout_tagSIZE() {
    assert_eq!(
        ::std::mem::size_of::<tagSIZE>(),
        8usize,
        concat!("Size of: ", stringify!(tagSIZE))
    );
    assert_eq!(
        ::std::mem::align_of::<tagSIZE>(),
        4usize,
        concat!("Alignment of ", stringify!(tagSIZE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagSIZE>())).cx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSIZE),
            "::",
            stringify!(cx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagSIZE>())).cy as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSIZE),
            "::",
            stringify!(cy)
        )
    );
}
pub type SIZE = tagSIZE;
pub type SIZEL = SIZE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
    pub Data1: UINT32,
    pub Data2: UINT16,
    pub Data3: UINT16,
    pub Data4: [BYTE; 8usize],
}
#[test]
fn bindgen_test_layout__GUID() {
    assert_eq!(
        ::std::mem::size_of::<_GUID>(),
        16usize,
        concat!("Size of: ", stringify!(_GUID))
    );
    assert_eq!(
        ::std::mem::align_of::<_GUID>(),
        4usize,
        concat!("Alignment of ", stringify!(_GUID))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data3 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data4)
        )
    );
}
pub type GUID = _GUID;
pub type CLSID = GUID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FILETIME {
    pub dwLowDateTime: DWORD,
    pub dwHighDateTime: DWORD,
}
#[test]
fn bindgen_test_layout__FILETIME() {
    assert_eq!(
        ::std::mem::size_of::<_FILETIME>(),
        8usize,
        concat!("Size of: ", stringify!(_FILETIME))
    );
    assert_eq!(
        ::std::mem::align_of::<_FILETIME>(),
        4usize,
        concat!("Alignment of ", stringify!(_FILETIME))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FILETIME>())).dwLowDateTime as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILETIME),
            "::",
            stringify!(dwLowDateTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_FILETIME>())).dwHighDateTime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILETIME),
            "::",
            stringify!(dwHighDateTime)
        )
    );
}
pub type FILETIME = _FILETIME;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEMTIME {
    pub wYear: WORD,
    pub wMonth: WORD,
    pub wDayOfWeek: WORD,
    pub wDay: WORD,
    pub wHour: WORD,
    pub wMinute: WORD,
    pub wSecond: WORD,
    pub wMilliseconds: WORD,
}
#[test]
fn bindgen_test_layout__SYSTEMTIME() {
    assert_eq!(
        ::std::mem::size_of::<_SYSTEMTIME>(),
        16usize,
        concat!("Size of: ", stringify!(_SYSTEMTIME))
    );
    assert_eq!(
        ::std::mem::align_of::<_SYSTEMTIME>(),
        2usize,
        concat!("Alignment of ", stringify!(_SYSTEMTIME))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wYear as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wYear)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wMonth as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wMonth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wDayOfWeek as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wDayOfWeek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wDay as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wDay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wHour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wHour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wMinute as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wMinute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wSecond as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wSecond)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wMilliseconds as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEMTIME),
            "::",
            stringify!(wMilliseconds)
        )
    );
}
pub type SYSTEMTIME = _SYSTEMTIME;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_SID_IDENTIFIER_AUTHORITY {
    pub Value: [BYTE; 6usize],
}
#[test]
fn bindgen_test_layout__RPC_SID_IDENTIFIER_AUTHORITY() {
    assert_eq!(
        ::std::mem::size_of::<_RPC_SID_IDENTIFIER_AUTHORITY>(),
        6usize,
        concat!("Size of: ", stringify!(_RPC_SID_IDENTIFIER_AUTHORITY))
    );
    assert_eq!(
        ::std::mem::align_of::<_RPC_SID_IDENTIFIER_AUTHORITY>(),
        1usize,
        concat!("Alignment of ", stringify!(_RPC_SID_IDENTIFIER_AUTHORITY))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_RPC_SID_IDENTIFIER_AUTHORITY>())).Value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RPC_SID_IDENTIFIER_AUTHORITY),
            "::",
            stringify!(Value)
        )
    );
}
pub type RPC_SID_IDENTIFIER_AUTHORITY = _RPC_SID_IDENTIFIER_AUTHORITY;
pub type SECURITY_INFORMATION = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_SID {
    pub Revision: UCHAR,
    pub SubAuthorityCount: UCHAR,
    pub IdentifierAuthority: RPC_SID_IDENTIFIER_AUTHORITY,
    pub SubAuthority: [ULONG; 1usize],
}
#[test]
fn bindgen_test_layout__RPC_SID() {
    assert_eq!(
        ::std::mem::size_of::<_RPC_SID>(),
        12usize,
        concat!("Size of: ", stringify!(_RPC_SID))
    );
    assert_eq!(
        ::std::mem::align_of::<_RPC_SID>(),
        4usize,
        concat!("Alignment of ", stringify!(_RPC_SID))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RPC_SID>())).Revision as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RPC_SID),
            "::",
            stringify!(Revision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RPC_SID>())).SubAuthorityCount as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_RPC_SID),
            "::",
            stringify!(SubAuthorityCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RPC_SID>())).IdentifierAuthority as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_RPC_SID),
            "::",
            stringify!(IdentifierAuthority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RPC_SID>())).SubAuthority as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_RPC_SID),
            "::",
            stringify!(SubAuthority)
        )
    );
}
pub type PSID = *mut _RPC_SID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL {
    pub AclRevision: UCHAR,
    pub Sbz1: UCHAR,
    pub AclSize: USHORT,
    pub AceCount: USHORT,
    pub Sbz2: USHORT,
}
#[test]
fn bindgen_test_layout__ACL() {
    assert_eq!(
        ::std::mem::size_of::<_ACL>(),
        8usize,
        concat!("Size of: ", stringify!(_ACL))
    );
    assert_eq!(
        ::std::mem::align_of::<_ACL>(),
        2usize,
        concat!("Alignment of ", stringify!(_ACL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ACL>())).AclRevision as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACL),
            "::",
            stringify!(AclRevision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ACL>())).Sbz1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACL),
            "::",
            stringify!(Sbz1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ACL>())).AclSize as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACL),
            "::",
            stringify!(AclSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ACL>())).AceCount as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACL),
            "::",
            stringify!(AceCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ACL>())).Sbz2 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACL),
            "::",
            stringify!(Sbz2)
        )
    );
}
pub type PACL = *mut _ACL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR {
    pub Revision: UCHAR,
    pub Sbz1: UCHAR,
    pub Control: USHORT,
    pub Owner: PSID,
    pub Group: PSID,
    pub Sacl: PACL,
    pub Dacl: PACL,
}
#[test]
fn bindgen_test_layout__SECURITY_DESCRIPTOR() {
    assert_eq!(
        ::std::mem::size_of::<_SECURITY_DESCRIPTOR>(),
        40usize,
        concat!("Size of: ", stringify!(_SECURITY_DESCRIPTOR))
    );
    assert_eq!(
        ::std::mem::align_of::<_SECURITY_DESCRIPTOR>(),
        8usize,
        concat!("Alignment of ", stringify!(_SECURITY_DESCRIPTOR))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Revision as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Revision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Sbz1 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Sbz1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Control as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Control)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Group as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Sacl as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Sacl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Dacl as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_DESCRIPTOR),
            "::",
            stringify!(Dacl)
        )
    );
}
pub type PSECURITY_DESCRIPTOR = *mut _SECURITY_DESCRIPTOR;
pub type PSECURITY_DESCRIPTOR_CONTROL = *mut WORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_ATTRIBUTES {
    pub nLength: DWORD,
    pub lpSecurityDescriptor: LPVOID,
    pub bInheritHandle: BOOL,
}
#[test]
fn bindgen_test_layout__SECURITY_ATTRIBUTES() {
    assert_eq!(
        ::std::mem::size_of::<_SECURITY_ATTRIBUTES>(),
        24usize,
        concat!("Size of: ", stringify!(_SECURITY_ATTRIBUTES))
    );
    assert_eq!(
        ::std::mem::align_of::<_SECURITY_ATTRIBUTES>(),
        8usize,
        concat!("Alignment of ", stringify!(_SECURITY_ATTRIBUTES))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).nLength as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_ATTRIBUTES),
            "::",
            stringify!(nLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).lpSecurityDescriptor as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_ATTRIBUTES),
            "::",
            stringify!(lpSecurityDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).bInheritHandle as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_ATTRIBUTES),
            "::",
            stringify!(bInheritHandle)
        )
    );
}
pub type LPSECURITY_ATTRIBUTES = *mut _SECURITY_ATTRIBUTES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESS_INFORMATION {
    pub hProcess: HANDLE,
    pub hThread: HANDLE,
    pub dwProcessId: DWORD,
    pub dwThreadId: DWORD,
}
#[test]
fn bindgen_test_layout__PROCESS_INFORMATION() {
    assert_eq!(
        ::std::mem::size_of::<_PROCESS_INFORMATION>(),
        24usize,
        concat!("Size of: ", stringify!(_PROCESS_INFORMATION))
    );
    assert_eq!(
        ::std::mem::align_of::<_PROCESS_INFORMATION>(),
        8usize,
        concat!("Alignment of ", stringify!(_PROCESS_INFORMATION))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).hProcess as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PROCESS_INFORMATION),
            "::",
            stringify!(hProcess)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).hThread as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PROCESS_INFORMATION),
            "::",
            stringify!(hThread)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).dwProcessId as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_PROCESS_INFORMATION),
            "::",
            stringify!(dwProcessId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).dwThreadId as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_PROCESS_INFORMATION),
            "::",
            stringify!(dwThreadId)
        )
    );
}
pub type LPPROCESS_INFORMATION = *mut _PROCESS_INFORMATION;
pub type PTHREAD_START_ROUTINE =
    ::std::option::Option<unsafe extern "C" fn(lpThreadParameter: LPVOID) -> DWORD>;
pub type LPTHREAD_START_ROUTINE = PTHREAD_START_ROUTINE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _OVERLAPPED {
    pub Internal: ULONG_PTR,
    pub InternalHigh: ULONG_PTR,
    pub __bindgen_anon_1: _OVERLAPPED__bindgen_ty_1,
    pub hEvent: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _OVERLAPPED__bindgen_ty_1 {
    pub __bindgen_anon_1: _OVERLAPPED__bindgen_ty_1__bindgen_ty_1,
    pub Pointer: PVOID,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OVERLAPPED__bindgen_ty_1__bindgen_ty_1 {
    pub Offset: DWORD,
    pub OffsetHigh: DWORD,
}
#[test]
fn bindgen_test_layout__OVERLAPPED__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>())).Offset as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>())).OffsetHigh
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(OffsetHigh)
        )
    );
}
#[test]
fn bindgen_test_layout__OVERLAPPED__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_OVERLAPPED__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_OVERLAPPED__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_OVERLAPPED__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_OVERLAPPED__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_OVERLAPPED__bindgen_ty_1>())).Pointer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED__bindgen_ty_1),
            "::",
            stringify!(Pointer)
        )
    );
}
#[test]
fn bindgen_test_layout__OVERLAPPED() {
    assert_eq!(
        ::std::mem::size_of::<_OVERLAPPED>(),
        32usize,
        concat!("Size of: ", stringify!(_OVERLAPPED))
    );
    assert_eq!(
        ::std::mem::align_of::<_OVERLAPPED>(),
        8usize,
        concat!("Alignment of ", stringify!(_OVERLAPPED))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_OVERLAPPED>())).Internal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED),
            "::",
            stringify!(Internal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_OVERLAPPED>())).InternalHigh as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED),
            "::",
            stringify!(InternalHigh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_OVERLAPPED>())).hEvent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED),
            "::",
            stringify!(hEvent)
        )
    );
}
pub type LPOVERLAPPED = *mut _OVERLAPPED;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OVERLAPPED_ENTRY {
    pub lpCompletionKey: ULONG_PTR,
    pub lpOverlapped: LPOVERLAPPED,
    pub Internal: ULONG_PTR,
    pub dwNumberOfBytesTransferred: DWORD,
}
#[test]
fn bindgen_test_layout__OVERLAPPED_ENTRY() {
    assert_eq!(
        ::std::mem::size_of::<_OVERLAPPED_ENTRY>(),
        32usize,
        concat!("Size of: ", stringify!(_OVERLAPPED_ENTRY))
    );
    assert_eq!(
        ::std::mem::align_of::<_OVERLAPPED_ENTRY>(),
        8usize,
        concat!("Alignment of ", stringify!(_OVERLAPPED_ENTRY))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_OVERLAPPED_ENTRY>())).lpCompletionKey as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED_ENTRY),
            "::",
            stringify!(lpCompletionKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_OVERLAPPED_ENTRY>())).lpOverlapped as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED_ENTRY),
            "::",
            stringify!(lpOverlapped)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_OVERLAPPED_ENTRY>())).Internal as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED_ENTRY),
            "::",
            stringify!(Internal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_OVERLAPPED_ENTRY>())).dwNumberOfBytesTransferred as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_OVERLAPPED_ENTRY),
            "::",
            stringify!(dwNumberOfBytesTransferred)
        )
    );
}
pub type LPOVERLAPPED_ENTRY = *mut _OVERLAPPED_ENTRY;
extern "C" {
    pub fn GetOverlappedResult(
        hFile: HANDLE,
        lpOverlapped: LPOVERLAPPED,
        lpNumberOfBytesTransferred: LPDWORD,
        bWait: BOOL,
    ) -> BOOL;
}
extern "C" {
    pub fn GetOverlappedResultEx(
        hFile: HANDLE,
        lpOverlapped: LPOVERLAPPED,
        lpNumberOfBytesTransferred: LPDWORD,
        dwMilliseconds: DWORD,
        bAlertable: BOOL,
    ) -> BOOL;
}
extern "C" {
    pub fn CreateIoCompletionPort(
        FileHandle: HANDLE,
        ExistingCompletionPort: HANDLE,
        CompletionKey: ULONG_PTR,
        NumberOfConcurrentThreads: DWORD,
    ) -> HANDLE;
}
extern "C" {
    pub fn GetQueuedCompletionStatus(
        CompletionPort: HANDLE,
        lpNumberOfBytesTransferred: LPDWORD,
        lpCompletionKey: PULONG_PTR,
        lpOverlapped: *mut LPOVERLAPPED,
        dwMilliseconds: DWORD,
    ) -> BOOL;
}
extern "C" {
    pub fn GetQueuedCompletionStatusEx(
        CompletionPort: HANDLE,
        lpCompletionPortEntries: LPOVERLAPPED_ENTRY,
        ulCount: ULONG,
        ulNumEntriesRemoved: PULONG,
        dwMilliseconds: DWORD,
        fAlertable: BOOL,
    ) -> BOOL;
}
extern "C" {
    pub fn GetErrorMode() -> UINT;
}
extern "C" {
    pub fn GetLastError() -> DWORD;
}
extern "C" {
    pub fn CreateFileA(
        lpFileName: LPCSTR,
        dwDesiredAccess: DWORD,
        dwShareMode: DWORD,
        lpSecurityAttributes: LPSECURITY_ATTRIBUTES,
        dwCreationDisposition: DWORD,
        dwFlagsAndAttributes: DWORD,
        hTemplateFile: HANDLE,
    ) -> HANDLE;
}
extern "C" {
    pub fn CreateFileW(
        lpFileName: LPCWSTR,
        dwDesiredAccess: DWORD,
        dwShareMode: DWORD,
        lpSecurityAttributes: LPSECURITY_ATTRIBUTES,
        dwCreationDisposition: DWORD,
        dwFlagsAndAttributes: DWORD,
        hTemplateFile: HANDLE,
    ) -> HANDLE;
}
pub const _GET_FILEEX_INFO_LEVELS_GetFileExInfoStandard: _GET_FILEEX_INFO_LEVELS = 0;
pub const _GET_FILEEX_INFO_LEVELS_GetFileExMaxInfoLevel: _GET_FILEEX_INFO_LEVELS = 1;
pub type _GET_FILEEX_INFO_LEVELS = ::std::os::raw::c_uint;
pub use self::_GET_FILEEX_INFO_LEVELS as GET_FILEEX_INFO_LEVELS;
extern "C" {
    pub fn GetFileAttributesExA(
        lpFileName: LPCSTR,
        fInfoLevelId: GET_FILEEX_INFO_LEVELS,
        lpFileInformation: LPVOID,
    ) -> BOOL;
}
extern "C" {
    pub fn GetFileAttributesA(lpFileName: LPCSTR) -> DWORD;
}
extern "C" {
    pub fn GetFileAttributesExW(
        lpFileName: LPCWSTR,
        fInfoLevelId: GET_FILEEX_INFO_LEVELS,
        lpFileInformation: LPVOID,
    ) -> BOOL;
}
extern "C" {
    pub fn GetFileAttributesW(lpFileName: LPCWSTR) -> DWORD;
}
extern "C" {
    pub fn GetFileSize(hFile: HANDLE, lpFileSizeHigh: LPDWORD) -> DWORD;
}
extern "C" {
    pub fn CreateDirectoryA(
        lpPathName: LPCSTR,
        lpSecurityAttributes: LPSECURITY_ATTRIBUTES,
    ) -> BOOL;
}
extern "C" {
    pub fn CreateDirectoryW(
        lpPathName: LPCWSTR,
        lpSecurityAttributes: LPSECURITY_ATTRIBUTES,
    ) -> BOOL;
}
extern "C" {
    pub fn GetStdHandle(nStdHandle: DWORD) -> HANDLE;
}
extern "C" {
    pub fn GetDiskFreeSpaceA(
        lpRootPathName: LPCSTR,
        lpSectorsPerCluster: LPDWORD,
        lpBytesPerSector: LPDWORD,
        lpNumberOfFreeClusters: LPDWORD,
        lpTotalNumberOfClusters: LPDWORD,
    ) -> BOOL;
}
extern "C" {
    pub fn GetDiskFreeSpaceW(
        lpRootPathName: LPCWSTR,
        lpSectorsPerCluster: LPDWORD,
        lpBytesPerSector: LPDWORD,
        lpNumberOfFreeClusters: LPDWORD,
        lpTotalNumberOfClusters: LPDWORD,
    ) -> BOOL;
}
extern "C" {
    pub fn GetNamedPipeNameWithoutPrefixA(lpName: LPCSTR) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn GetNamedPipeUnixDomainSocketBaseFilePathA() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn GetNamedPipeUnixDomainSocketFilePathA(lpName: LPCSTR) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn GetNamePipeFileDescriptor(hNamedPipe: HANDLE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn GetFileHandleForFileDescriptor(fd: ::std::os::raw::c_int) -> HANDLE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagCHANNEL_DEF {
    pub name: [::std::os::raw::c_char; 8usize],
    pub options: ULONG,
}
#[test]
fn bindgen_test_layout_tagCHANNEL_DEF() {
    assert_eq!(
        ::std::mem::size_of::<tagCHANNEL_DEF>(),
        12usize,
        concat!("Size of: ", stringify!(tagCHANNEL_DEF))
    );
    assert_eq!(
        ::std::mem::align_of::<tagCHANNEL_DEF>(),
        4usize,
        concat!("Alignment of ", stringify!(tagCHANNEL_DEF))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagCHANNEL_DEF>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_DEF),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagCHANNEL_DEF>())).options as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_DEF),
            "::",
            stringify!(options)
        )
    );
}
pub type CHANNEL_DEF = tagCHANNEL_DEF;
pub type PCHANNEL_DEF = *mut CHANNEL_DEF;
pub type CHANNEL_INIT_EVENT_FN = ::std::option::Option<
    unsafe extern "C" fn(pInitHandle: LPVOID, event: UINT, pData: LPVOID, dataLength: UINT),
>;
pub type PCHANNEL_INIT_EVENT_FN = CHANNEL_INIT_EVENT_FN;
pub type CHANNEL_INIT_EVENT_EX_FN = ::std::option::Option<
    unsafe extern "C" fn(
        lpUserParam: LPVOID,
        pInitHandle: LPVOID,
        event: UINT,
        pData: LPVOID,
        dataLength: UINT,
    ),
>;
pub type PCHANNEL_INIT_EVENT_EX_FN = CHANNEL_INIT_EVENT_EX_FN;
pub type CHANNEL_OPEN_EVENT_FN = ::std::option::Option<
    unsafe extern "C" fn(
        openHandle: DWORD,
        event: UINT,
        pData: LPVOID,
        dataLength: UINT32,
        totalLength: UINT32,
        dataFlags: UINT32,
    ),
>;
pub type PCHANNEL_OPEN_EVENT_FN = CHANNEL_OPEN_EVENT_FN;
pub type CHANNEL_OPEN_EVENT_EX_FN = ::std::option::Option<
    unsafe extern "C" fn(
        lpUserParam: LPVOID,
        openHandle: DWORD,
        event: UINT,
        pData: LPVOID,
        dataLength: UINT32,
        totalLength: UINT32,
        dataFlags: UINT32,
    ),
>;
pub type PCHANNEL_OPEN_EVENT_EX_FN = CHANNEL_OPEN_EVENT_EX_FN;
pub type VIRTUALCHANNELINIT = ::std::option::Option<
    unsafe extern "C" fn(
        ppInitHandle: *mut LPVOID,
        pChannel: PCHANNEL_DEF,
        channelCount: INT,
        versionRequested: ULONG,
        pChannelInitEventProc: PCHANNEL_INIT_EVENT_FN,
    ) -> UINT,
>;
pub type PVIRTUALCHANNELINIT = VIRTUALCHANNELINIT;
pub type VIRTUALCHANNELINITEX = ::std::option::Option<
    unsafe extern "C" fn(
        lpUserParam: LPVOID,
        clientContext: LPVOID,
        pInitHandle: LPVOID,
        pChannel: PCHANNEL_DEF,
        channelCount: INT,
        versionRequested: ULONG,
        pChannelInitEventProcEx: PCHANNEL_INIT_EVENT_EX_FN,
    ) -> UINT,
>;
pub type PVIRTUALCHANNELINITEX = VIRTUALCHANNELINITEX;
pub type VIRTUALCHANNELOPEN = ::std::option::Option<
    unsafe extern "C" fn(
        pInitHandle: LPVOID,
        pOpenHandle: LPDWORD,
        pChannelName: PCHAR,
        pChannelOpenEventProc: PCHANNEL_OPEN_EVENT_FN,
    ) -> UINT,
>;
pub type PVIRTUALCHANNELOPEN = VIRTUALCHANNELOPEN;
pub type VIRTUALCHANNELOPENEX = ::std::option::Option<
    unsafe extern "C" fn(
        pInitHandle: LPVOID,
        pOpenHandle: LPDWORD,
        pChannelName: PCHAR,
        pChannelOpenEventProcEx: PCHANNEL_OPEN_EVENT_EX_FN,
    ) -> UINT,
>;
pub type PVIRTUALCHANNELOPENEX = VIRTUALCHANNELOPENEX;
pub type VIRTUALCHANNELCLOSE =
    ::std::option::Option<unsafe extern "C" fn(openHandle: DWORD) -> UINT>;
pub type PVIRTUALCHANNELCLOSE = VIRTUALCHANNELCLOSE;
pub type VIRTUALCHANNELCLOSEEX =
    ::std::option::Option<unsafe extern "C" fn(pInitHandle: LPVOID, openHandle: DWORD) -> UINT>;
pub type PVIRTUALCHANNELCLOSEEX = VIRTUALCHANNELCLOSEEX;
pub type VIRTUALCHANNELWRITE = ::std::option::Option<
    unsafe extern "C" fn(
        openHandle: DWORD,
        pData: LPVOID,
        dataLength: ULONG,
        pUserData: LPVOID,
    ) -> UINT,
>;
pub type PVIRTUALCHANNELWRITE = VIRTUALCHANNELWRITE;
pub type VIRTUALCHANNELWRITEEX = ::std::option::Option<
    unsafe extern "C" fn(
        pInitHandle: LPVOID,
        openHandle: DWORD,
        pData: LPVOID,
        dataLength: ULONG,
        pUserData: LPVOID,
    ) -> UINT,
>;
pub type PVIRTUALCHANNELWRITEEX = VIRTUALCHANNELWRITEEX;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagCHANNEL_ENTRY_POINTS {
    pub cbSize: DWORD,
    pub protocolVersion: DWORD,
    pub pVirtualChannelInit: PVIRTUALCHANNELINIT,
    pub pVirtualChannelOpen: PVIRTUALCHANNELOPEN,
    pub pVirtualChannelClose: PVIRTUALCHANNELCLOSE,
    pub pVirtualChannelWrite: PVIRTUALCHANNELWRITE,
}
#[test]
fn bindgen_test_layout_tagCHANNEL_ENTRY_POINTS() {
    assert_eq!(
        ::std::mem::size_of::<tagCHANNEL_ENTRY_POINTS>(),
        40usize,
        concat!("Size of: ", stringify!(tagCHANNEL_ENTRY_POINTS))
    );
    assert_eq!(
        ::std::mem::align_of::<tagCHANNEL_ENTRY_POINTS>(),
        8usize,
        concat!("Alignment of ", stringify!(tagCHANNEL_ENTRY_POINTS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS>())).cbSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS),
            "::",
            stringify!(cbSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS>())).protocolVersion as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS),
            "::",
            stringify!(protocolVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS>())).pVirtualChannelInit as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS),
            "::",
            stringify!(pVirtualChannelInit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS>())).pVirtualChannelOpen as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS),
            "::",
            stringify!(pVirtualChannelOpen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS>())).pVirtualChannelClose as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS),
            "::",
            stringify!(pVirtualChannelClose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS>())).pVirtualChannelWrite as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS),
            "::",
            stringify!(pVirtualChannelWrite)
        )
    );
}
pub type PCHANNEL_ENTRY_POINTS = *mut tagCHANNEL_ENTRY_POINTS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagCHANNEL_ENTRY_POINTS_EX {
    pub cbSize: DWORD,
    pub protocolVersion: DWORD,
    pub pVirtualChannelInitEx: PVIRTUALCHANNELINITEX,
    pub pVirtualChannelOpenEx: PVIRTUALCHANNELOPENEX,
    pub pVirtualChannelCloseEx: PVIRTUALCHANNELCLOSEEX,
    pub pVirtualChannelWriteEx: PVIRTUALCHANNELWRITEEX,
}
#[test]
fn bindgen_test_layout_tagCHANNEL_ENTRY_POINTS_EX() {
    assert_eq!(
        ::std::mem::size_of::<tagCHANNEL_ENTRY_POINTS_EX>(),
        40usize,
        concat!("Size of: ", stringify!(tagCHANNEL_ENTRY_POINTS_EX))
    );
    assert_eq!(
        ::std::mem::align_of::<tagCHANNEL_ENTRY_POINTS_EX>(),
        8usize,
        concat!("Alignment of ", stringify!(tagCHANNEL_ENTRY_POINTS_EX))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS_EX>())).cbSize as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS_EX),
            "::",
            stringify!(cbSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS_EX>())).protocolVersion as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS_EX),
            "::",
            stringify!(protocolVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS_EX>())).pVirtualChannelInitEx as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS_EX),
            "::",
            stringify!(pVirtualChannelInitEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS_EX>())).pVirtualChannelOpenEx as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS_EX),
            "::",
            stringify!(pVirtualChannelOpenEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS_EX>())).pVirtualChannelCloseEx
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS_EX),
            "::",
            stringify!(pVirtualChannelCloseEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tagCHANNEL_ENTRY_POINTS_EX>())).pVirtualChannelWriteEx
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tagCHANNEL_ENTRY_POINTS_EX),
            "::",
            stringify!(pVirtualChannelWriteEx)
        )
    );
}
pub type PCHANNEL_ENTRY_POINTS_EX = *mut tagCHANNEL_ENTRY_POINTS_EX;
pub type VIRTUALCHANNELENTRY =
    ::std::option::Option<unsafe extern "C" fn(pEntryPoints: PCHANNEL_ENTRY_POINTS) -> BOOL>;
pub type PVIRTUALCHANNELENTRY = VIRTUALCHANNELENTRY;
pub type VIRTUALCHANNELENTRYEX = ::std::option::Option<
    unsafe extern "C" fn(pEntryPointsEx: PCHANNEL_ENTRY_POINTS_EX, pInitHandle: PVOID) -> BOOL,
>;
pub type PVIRTUALCHANNELENTRYEX = VIRTUALCHANNELENTRYEX;
pub const _WTS_CONNECTSTATE_CLASS_WTSActive: _WTS_CONNECTSTATE_CLASS = 0;
pub const _WTS_CONNECTSTATE_CLASS_WTSConnected: _WTS_CONNECTSTATE_CLASS = 1;
pub const _WTS_CONNECTSTATE_CLASS_WTSConnectQuery: _WTS_CONNECTSTATE_CLASS = 2;
pub const _WTS_CONNECTSTATE_CLASS_WTSShadow: _WTS_CONNECTSTATE_CLASS = 3;
pub const _WTS_CONNECTSTATE_CLASS_WTSDisconnected: _WTS_CONNECTSTATE_CLASS = 4;
pub const _WTS_CONNECTSTATE_CLASS_WTSIdle: _WTS_CONNECTSTATE_CLASS = 5;
pub const _WTS_CONNECTSTATE_CLASS_WTSListen: _WTS_CONNECTSTATE_CLASS = 6;
pub const _WTS_CONNECTSTATE_CLASS_WTSReset: _WTS_CONNECTSTATE_CLASS = 7;
pub const _WTS_CONNECTSTATE_CLASS_WTSDown: _WTS_CONNECTSTATE_CLASS = 8;
pub const _WTS_CONNECTSTATE_CLASS_WTSInit: _WTS_CONNECTSTATE_CLASS = 9;
pub type _WTS_CONNECTSTATE_CLASS = ::std::os::raw::c_uint;
pub use self::_WTS_CONNECTSTATE_CLASS as WTS_CONNECTSTATE_CLASS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_SERVER_INFOW {
    pub pServerName: LPWSTR,
}
#[test]
fn bindgen_test_layout__WTS_SERVER_INFOW() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_SERVER_INFOW>(),
        8usize,
        concat!("Size of: ", stringify!(_WTS_SERVER_INFOW))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_SERVER_INFOW>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_SERVER_INFOW))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SERVER_INFOW>())).pServerName as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SERVER_INFOW),
            "::",
            stringify!(pServerName)
        )
    );
}
pub type PWTS_SERVER_INFOW = *mut _WTS_SERVER_INFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_SERVER_INFOA {
    pub pServerName: LPSTR,
}
#[test]
fn bindgen_test_layout__WTS_SERVER_INFOA() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_SERVER_INFOA>(),
        8usize,
        concat!("Size of: ", stringify!(_WTS_SERVER_INFOA))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_SERVER_INFOA>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_SERVER_INFOA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SERVER_INFOA>())).pServerName as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SERVER_INFOA),
            "::",
            stringify!(pServerName)
        )
    );
}
pub type PWTS_SERVER_INFOA = *mut _WTS_SERVER_INFOA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_SESSION_INFOW {
    pub SessionId: DWORD,
    pub pWinStationName: LPWSTR,
    pub State: WTS_CONNECTSTATE_CLASS,
}
#[test]
fn bindgen_test_layout__WTS_SESSION_INFOW() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_SESSION_INFOW>(),
        24usize,
        concat!("Size of: ", stringify!(_WTS_SESSION_INFOW))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_SESSION_INFOW>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_SESSION_INFOW))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFOW>())).SessionId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFOW),
            "::",
            stringify!(SessionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTS_SESSION_INFOW>())).pWinStationName as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFOW),
            "::",
            stringify!(pWinStationName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFOW>())).State as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFOW),
            "::",
            stringify!(State)
        )
    );
}
pub type PWTS_SESSION_INFOW = *mut _WTS_SESSION_INFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_SESSION_INFOA {
    pub SessionId: DWORD,
    pub pWinStationName: LPSTR,
    pub State: WTS_CONNECTSTATE_CLASS,
}
#[test]
fn bindgen_test_layout__WTS_SESSION_INFOA() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_SESSION_INFOA>(),
        24usize,
        concat!("Size of: ", stringify!(_WTS_SESSION_INFOA))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_SESSION_INFOA>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_SESSION_INFOA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFOA>())).SessionId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFOA),
            "::",
            stringify!(SessionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTS_SESSION_INFOA>())).pWinStationName as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFOA),
            "::",
            stringify!(pWinStationName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFOA>())).State as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFOA),
            "::",
            stringify!(State)
        )
    );
}
pub type PWTS_SESSION_INFOA = *mut _WTS_SESSION_INFOA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_SESSION_INFO_1W {
    pub ExecEnvId: DWORD,
    pub State: WTS_CONNECTSTATE_CLASS,
    pub SessionId: DWORD,
    pub pSessionName: LPWSTR,
    pub pHostName: LPWSTR,
    pub pUserName: LPWSTR,
    pub pDomainName: LPWSTR,
    pub pFarmName: LPWSTR,
}
#[test]
fn bindgen_test_layout__WTS_SESSION_INFO_1W() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_SESSION_INFO_1W>(),
        56usize,
        concat!("Size of: ", stringify!(_WTS_SESSION_INFO_1W))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_SESSION_INFO_1W>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_SESSION_INFO_1W))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).ExecEnvId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(ExecEnvId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).State as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).SessionId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(SessionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).pSessionName as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(pSessionName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).pHostName as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(pHostName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).pUserName as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(pUserName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).pDomainName as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(pDomainName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1W>())).pFarmName as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1W),
            "::",
            stringify!(pFarmName)
        )
    );
}
pub type PWTS_SESSION_INFO_1W = *mut _WTS_SESSION_INFO_1W;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_SESSION_INFO_1A {
    pub ExecEnvId: DWORD,
    pub State: WTS_CONNECTSTATE_CLASS,
    pub SessionId: DWORD,
    pub pSessionName: LPSTR,
    pub pHostName: LPSTR,
    pub pUserName: LPSTR,
    pub pDomainName: LPSTR,
    pub pFarmName: LPSTR,
}
#[test]
fn bindgen_test_layout__WTS_SESSION_INFO_1A() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_SESSION_INFO_1A>(),
        56usize,
        concat!("Size of: ", stringify!(_WTS_SESSION_INFO_1A))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_SESSION_INFO_1A>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_SESSION_INFO_1A))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).ExecEnvId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(ExecEnvId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).State as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(State)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).SessionId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(SessionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).pSessionName as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(pSessionName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).pHostName as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(pHostName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).pUserName as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(pUserName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).pDomainName as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(pDomainName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_SESSION_INFO_1A>())).pFarmName as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_SESSION_INFO_1A),
            "::",
            stringify!(pFarmName)
        )
    );
}
pub type PWTS_SESSION_INFO_1A = *mut _WTS_SESSION_INFO_1A;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_PROCESS_INFOW {
    pub SessionId: DWORD,
    pub ProcessId: DWORD,
    pub pProcessName: LPWSTR,
    pub pUserSid: PSID,
}
#[test]
fn bindgen_test_layout__WTS_PROCESS_INFOW() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_PROCESS_INFOW>(),
        24usize,
        concat!("Size of: ", stringify!(_WTS_PROCESS_INFOW))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_PROCESS_INFOW>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_PROCESS_INFOW))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOW>())).SessionId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOW),
            "::",
            stringify!(SessionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOW>())).ProcessId as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOW),
            "::",
            stringify!(ProcessId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOW>())).pProcessName as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOW),
            "::",
            stringify!(pProcessName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOW>())).pUserSid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOW),
            "::",
            stringify!(pUserSid)
        )
    );
}
pub type PWTS_PROCESS_INFOW = *mut _WTS_PROCESS_INFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTS_PROCESS_INFOA {
    pub SessionId: DWORD,
    pub ProcessId: DWORD,
    pub pProcessName: LPSTR,
    pub pUserSid: PSID,
}
#[test]
fn bindgen_test_layout__WTS_PROCESS_INFOA() {
    assert_eq!(
        ::std::mem::size_of::<_WTS_PROCESS_INFOA>(),
        24usize,
        concat!("Size of: ", stringify!(_WTS_PROCESS_INFOA))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTS_PROCESS_INFOA>(),
        8usize,
        concat!("Alignment of ", stringify!(_WTS_PROCESS_INFOA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOA>())).SessionId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOA),
            "::",
            stringify!(SessionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOA>())).ProcessId as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOA),
            "::",
            stringify!(ProcessId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOA>())).pProcessName as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOA),
            "::",
            stringify!(pProcessName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTS_PROCESS_INFOA>())).pUserSid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTS_PROCESS_INFOA),
            "::",
            stringify!(pUserSid)
        )
    );
}
pub type PWTS_PROCESS_INFOA = *mut _WTS_PROCESS_INFOA;
pub const _WTS_INFO_CLASS_WTSInitialProgram: _WTS_INFO_CLASS = 0;
pub const _WTS_INFO_CLASS_WTSApplicationName: _WTS_INFO_CLASS = 1;
pub const _WTS_INFO_CLASS_WTSWorkingDirectory: _WTS_INFO_CLASS = 2;
pub const _WTS_INFO_CLASS_WTSOEMId: _WTS_INFO_CLASS = 3;
pub const _WTS_INFO_CLASS_WTSSessionId: _WTS_INFO_CLASS = 4;
pub const _WTS_INFO_CLASS_WTSUserName: _WTS_INFO_CLASS = 5;
pub const _WTS_INFO_CLASS_WTSWinStationName: _WTS_INFO_CLASS = 6;
pub const _WTS_INFO_CLASS_WTSDomainName: _WTS_INFO_CLASS = 7;
pub const _WTS_INFO_CLASS_WTSConnectState: _WTS_INFO_CLASS = 8;
pub const _WTS_INFO_CLASS_WTSClientBuildNumber: _WTS_INFO_CLASS = 9;
pub const _WTS_INFO_CLASS_WTSClientName: _WTS_INFO_CLASS = 10;
pub const _WTS_INFO_CLASS_WTSClientDirectory: _WTS_INFO_CLASS = 11;
pub const _WTS_INFO_CLASS_WTSClientProductId: _WTS_INFO_CLASS = 12;
pub const _WTS_INFO_CLASS_WTSClientHardwareId: _WTS_INFO_CLASS = 13;
pub const _WTS_INFO_CLASS_WTSClientAddress: _WTS_INFO_CLASS = 14;
pub const _WTS_INFO_CLASS_WTSClientDisplay: _WTS_INFO_CLASS = 15;
pub const _WTS_INFO_CLASS_WTSClientProtocolType: _WTS_INFO_CLASS = 16;
pub const _WTS_INFO_CLASS_WTSIdleTime: _WTS_INFO_CLASS = 17;
pub const _WTS_INFO_CLASS_WTSLogonTime: _WTS_INFO_CLASS = 18;
pub const _WTS_INFO_CLASS_WTSIncomingBytes: _WTS_INFO_CLASS = 19;
pub const _WTS_INFO_CLASS_WTSOutgoingBytes: _WTS_INFO_CLASS = 20;
pub const _WTS_INFO_CLASS_WTSIncomingFrames: _WTS_INFO_CLASS = 21;
pub const _WTS_INFO_CLASS_WTSOutgoingFrames: _WTS_INFO_CLASS = 22;
pub const _WTS_INFO_CLASS_WTSClientInfo: _WTS_INFO_CLASS = 23;
pub const _WTS_INFO_CLASS_WTSSessionInfo: _WTS_INFO_CLASS = 24;
pub const _WTS_INFO_CLASS_WTSSessionInfoEx: _WTS_INFO_CLASS = 25;
pub const _WTS_INFO_CLASS_WTSConfigInfo: _WTS_INFO_CLASS = 26;
pub const _WTS_INFO_CLASS_WTSValidationInfo: _WTS_INFO_CLASS = 27;
pub const _WTS_INFO_CLASS_WTSSessionAddressV4: _WTS_INFO_CLASS = 28;
pub const _WTS_INFO_CLASS_WTSIsRemoteSession: _WTS_INFO_CLASS = 29;
pub type _WTS_INFO_CLASS = ::std::os::raw::c_uint;
pub use self::_WTS_INFO_CLASS as WTS_INFO_CLASS;
pub const _WTS_CONFIG_CLASS_WTSUserConfigInitialProgram: _WTS_CONFIG_CLASS = 0;
pub const _WTS_CONFIG_CLASS_WTSUserConfigWorkingDirectory: _WTS_CONFIG_CLASS = 1;
pub const _WTS_CONFIG_CLASS_WTSUserConfigfInheritInitialProgram: _WTS_CONFIG_CLASS = 2;
pub const _WTS_CONFIG_CLASS_WTSUserConfigfAllowLogonTerminalServer: _WTS_CONFIG_CLASS = 3;
pub const _WTS_CONFIG_CLASS_WTSUserConfigTimeoutSettingsConnections: _WTS_CONFIG_CLASS = 4;
pub const _WTS_CONFIG_CLASS_WTSUserConfigTimeoutSettingsDisconnections: _WTS_CONFIG_CLASS = 5;
pub const _WTS_CONFIG_CLASS_WTSUserConfigTimeoutSettingsIdle: _WTS_CONFIG_CLASS = 6;
pub const _WTS_CONFIG_CLASS_WTSUserConfigfDeviceClientDrives: _WTS_CONFIG_CLASS = 7;
pub const _WTS_CONFIG_CLASS_WTSUserConfigfDeviceClientPrinters: _WTS_CONFIG_CLASS = 8;
pub const _WTS_CONFIG_CLASS_WTSUserConfigfDeviceClientDefaultPrinter: _WTS_CONFIG_CLASS = 9;
pub const _WTS_CONFIG_CLASS_WTSUserConfigBrokenTimeoutSettings: _WTS_CONFIG_CLASS = 10;
pub const _WTS_CONFIG_CLASS_WTSUserConfigReconnectSettings: _WTS_CONFIG_CLASS = 11;
pub const _WTS_CONFIG_CLASS_WTSUserConfigModemCallbackSettings: _WTS_CONFIG_CLASS = 12;
pub const _WTS_CONFIG_CLASS_WTSUserConfigModemCallbackPhoneNumber: _WTS_CONFIG_CLASS = 13;
pub const _WTS_CONFIG_CLASS_WTSUserConfigShadowingSettings: _WTS_CONFIG_CLASS = 14;
pub const _WTS_CONFIG_CLASS_WTSUserConfigTerminalServerProfilePath: _WTS_CONFIG_CLASS = 15;
pub const _WTS_CONFIG_CLASS_WTSUserConfigTerminalServerHomeDir: _WTS_CONFIG_CLASS = 16;
pub const _WTS_CONFIG_CLASS_WTSUserConfigTerminalServerHomeDirDrive: _WTS_CONFIG_CLASS = 17;
pub const _WTS_CONFIG_CLASS_WTSUserConfigfTerminalServerRemoteHomeDir: _WTS_CONFIG_CLASS = 18;
pub const _WTS_CONFIG_CLASS_WTSUserConfigUser: _WTS_CONFIG_CLASS = 19;
pub type _WTS_CONFIG_CLASS = ::std::os::raw::c_uint;
pub use self::_WTS_CONFIG_CLASS as WTS_CONFIG_CLASS;
pub const _WTS_VIRTUAL_CLASS_WTSVirtualClientData: _WTS_VIRTUAL_CLASS = 0;
pub const _WTS_VIRTUAL_CLASS_WTSVirtualFileHandle: _WTS_VIRTUAL_CLASS = 1;
pub const _WTS_VIRTUAL_CLASS_WTSVirtualEventHandle: _WTS_VIRTUAL_CLASS = 2;
pub const _WTS_VIRTUAL_CLASS_WTSVirtualChannelReady: _WTS_VIRTUAL_CLASS = 3;
pub type _WTS_VIRTUAL_CLASS = ::std::os::raw::c_uint;
pub use self::_WTS_VIRTUAL_CLASS as WTS_VIRTUAL_CLASS;
pub const _WTS_TYPE_CLASS_WTSTypeProcessInfoLevel0: _WTS_TYPE_CLASS = 0;
pub const _WTS_TYPE_CLASS_WTSTypeProcessInfoLevel1: _WTS_TYPE_CLASS = 1;
pub const _WTS_TYPE_CLASS_WTSTypeSessionInfoLevel1: _WTS_TYPE_CLASS = 2;
pub type _WTS_TYPE_CLASS = ::std::os::raw::c_uint;
pub use self::_WTS_TYPE_CLASS as WTS_TYPE_CLASS;
pub type WTSLISTENERNAMEW = [WCHAR; 33usize];
pub type PWTSLISTENERNAMEW = *mut WTSLISTENERNAMEW;
pub type WTSLISTENERNAMEA = [CHAR; 33usize];
pub type PWTSLISTENERNAMEA = *mut WTSLISTENERNAMEA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTSLISTENERCONFIGW {
    pub version: ULONG,
    pub fEnableListener: ULONG,
    pub MaxConnectionCount: ULONG,
    pub fPromptForPassword: ULONG,
    pub fInheritColorDepth: ULONG,
    pub ColorDepth: ULONG,
    pub fInheritBrokenTimeoutSettings: ULONG,
    pub BrokenTimeoutSettings: ULONG,
    pub fDisablePrinterRedirection: ULONG,
    pub fDisableDriveRedirection: ULONG,
    pub fDisableComPortRedirection: ULONG,
    pub fDisableLPTPortRedirection: ULONG,
    pub fDisableClipboardRedirection: ULONG,
    pub fDisableAudioRedirection: ULONG,
    pub fDisablePNPRedirection: ULONG,
    pub fDisableDefaultMainClientPrinter: ULONG,
    pub LanAdapter: ULONG,
    pub PortNumber: ULONG,
    pub fInheritShadowSettings: ULONG,
    pub ShadowSettings: ULONG,
    pub TimeoutSettingsConnection: ULONG,
    pub TimeoutSettingsDisconnection: ULONG,
    pub TimeoutSettingsIdle: ULONG,
    pub SecurityLayer: ULONG,
    pub MinEncryptionLevel: ULONG,
    pub UserAuthentication: ULONG,
    pub Comment: [WCHAR; 61usize],
    pub LogonUserName: [WCHAR; 21usize],
    pub LogonDomain: [WCHAR; 18usize],
    pub WorkDirectory: [WCHAR; 261usize],
    pub InitialProgram: [WCHAR; 261usize],
}
#[test]
fn bindgen_test_layout__WTSLISTENERCONFIGW() {
    assert_eq!(
        ::std::mem::size_of::<_WTSLISTENERCONFIGW>(),
        1348usize,
        concat!("Size of: ", stringify!(_WTSLISTENERCONFIGW))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTSLISTENERCONFIGW>(),
        4usize,
        concat!("Alignment of ", stringify!(_WTSLISTENERCONFIGW))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fEnableListener as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fEnableListener)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).MaxConnectionCount as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(MaxConnectionCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fPromptForPassword as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fPromptForPassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fInheritColorDepth as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fInheritColorDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).ColorDepth as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(ColorDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fInheritBrokenTimeoutSettings
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fInheritBrokenTimeoutSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).BrokenTimeoutSettings as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(BrokenTimeoutSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisablePrinterRedirection as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisablePrinterRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisableDriveRedirection as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisableDriveRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisableComPortRedirection as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisableComPortRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisableLPTPortRedirection as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisableLPTPortRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisableClipboardRedirection as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisableClipboardRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisableAudioRedirection as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisableAudioRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisablePNPRedirection as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisablePNPRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fDisableDefaultMainClientPrinter
                as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fDisableDefaultMainClientPrinter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).LanAdapter as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(LanAdapter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).PortNumber as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(PortNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).fInheritShadowSettings as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(fInheritShadowSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).ShadowSettings as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(ShadowSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).TimeoutSettingsConnection as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(TimeoutSettingsConnection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).TimeoutSettingsDisconnection as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(TimeoutSettingsDisconnection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).TimeoutSettingsIdle as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(TimeoutSettingsIdle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).SecurityLayer as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(SecurityLayer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).MinEncryptionLevel as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(MinEncryptionLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).UserAuthentication as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(UserAuthentication)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).Comment as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(Comment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).LogonUserName as *const _ as usize
        },
        226usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(LogonUserName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).LogonDomain as *const _ as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(LogonDomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).WorkDirectory as *const _ as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(WorkDirectory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGW>())).InitialProgram as *const _ as usize
        },
        826usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGW),
            "::",
            stringify!(InitialProgram)
        )
    );
}
pub type PWTSLISTENERCONFIGW = *mut _WTSLISTENERCONFIGW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WTSLISTENERCONFIGA {
    pub version: ULONG,
    pub fEnableListener: ULONG,
    pub MaxConnectionCount: ULONG,
    pub fPromptForPassword: ULONG,
    pub fInheritColorDepth: ULONG,
    pub ColorDepth: ULONG,
    pub fInheritBrokenTimeoutSettings: ULONG,
    pub BrokenTimeoutSettings: ULONG,
    pub fDisablePrinterRedirection: ULONG,
    pub fDisableDriveRedirection: ULONG,
    pub fDisableComPortRedirection: ULONG,
    pub fDisableLPTPortRedirection: ULONG,
    pub fDisableClipboardRedirection: ULONG,
    pub fDisableAudioRedirection: ULONG,
    pub fDisablePNPRedirection: ULONG,
    pub fDisableDefaultMainClientPrinter: ULONG,
    pub LanAdapter: ULONG,
    pub PortNumber: ULONG,
    pub fInheritShadowSettings: ULONG,
    pub ShadowSettings: ULONG,
    pub TimeoutSettingsConnection: ULONG,
    pub TimeoutSettingsDisconnection: ULONG,
    pub TimeoutSettingsIdle: ULONG,
    pub SecurityLayer: ULONG,
    pub MinEncryptionLevel: ULONG,
    pub UserAuthentication: ULONG,
    pub Comment: [CHAR; 61usize],
    pub LogonUserName: [CHAR; 21usize],
    pub LogonDomain: [CHAR; 18usize],
    pub WorkDirectory: [CHAR; 261usize],
    pub InitialProgram: [CHAR; 261usize],
}
#[test]
fn bindgen_test_layout__WTSLISTENERCONFIGA() {
    assert_eq!(
        ::std::mem::size_of::<_WTSLISTENERCONFIGA>(),
        728usize,
        concat!("Size of: ", stringify!(_WTSLISTENERCONFIGA))
    );
    assert_eq!(
        ::std::mem::align_of::<_WTSLISTENERCONFIGA>(),
        4usize,
        concat!("Alignment of ", stringify!(_WTSLISTENERCONFIGA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fEnableListener as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fEnableListener)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).MaxConnectionCount as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(MaxConnectionCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fPromptForPassword as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fPromptForPassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fInheritColorDepth as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fInheritColorDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).ColorDepth as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(ColorDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fInheritBrokenTimeoutSettings
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fInheritBrokenTimeoutSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).BrokenTimeoutSettings as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(BrokenTimeoutSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisablePrinterRedirection as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisablePrinterRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisableDriveRedirection as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisableDriveRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisableComPortRedirection as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisableComPortRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisableLPTPortRedirection as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisableLPTPortRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisableClipboardRedirection as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisableClipboardRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisableAudioRedirection as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisableAudioRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisablePNPRedirection as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisablePNPRedirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fDisableDefaultMainClientPrinter
                as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fDisableDefaultMainClientPrinter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).LanAdapter as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(LanAdapter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).PortNumber as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(PortNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).fInheritShadowSettings as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(fInheritShadowSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).ShadowSettings as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(ShadowSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).TimeoutSettingsConnection as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(TimeoutSettingsConnection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).TimeoutSettingsDisconnection as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(TimeoutSettingsDisconnection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).TimeoutSettingsIdle as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(TimeoutSettingsIdle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).SecurityLayer as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(SecurityLayer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).MinEncryptionLevel as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(MinEncryptionLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).UserAuthentication as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(UserAuthentication)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).Comment as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(Comment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).LogonUserName as *const _ as usize
        },
        165usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(LogonUserName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).LogonDomain as *const _ as usize },
        186usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(LogonDomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).WorkDirectory as *const _ as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(WorkDirectory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WTSLISTENERCONFIGA>())).InitialProgram as *const _ as usize
        },
        465usize,
        concat!(
            "Offset of field: ",
            stringify!(_WTSLISTENERCONFIGA),
            "::",
            stringify!(InitialProgram)
        )
    );
}
pub type PWTSLISTENERCONFIGA = *mut _WTSLISTENERCONFIGA;
extern "C" {
    pub fn WTSVirtualChannelOpen(hServer: HANDLE, SessionId: DWORD, pVirtualName: LPSTR) -> HANDLE;
}
extern "C" {
    pub fn WTSVirtualChannelOpenEx(SessionId: DWORD, pVirtualName: LPSTR, flags: DWORD) -> HANDLE;
}
extern "C" {
    pub fn WTSVirtualChannelClose(hChannelHandle: HANDLE) -> BOOL;
}
extern "C" {
    pub fn WTSVirtualChannelRead(
        hChannelHandle: HANDLE,
        TimeOut: ULONG,
        Buffer: PCHAR,
        BufferSize: ULONG,
        pBytesRead: PULONG,
    ) -> BOOL;
}
extern "C" {
    pub fn WTSVirtualChannelWrite(
        hChannelHandle: HANDLE,
        Buffer: PCHAR,
        Length: ULONG,
        pBytesWritten: PULONG,
    ) -> BOOL;
}
extern "C" {
    pub fn WTSVirtualChannelPurgeInput(hChannelHandle: HANDLE) -> BOOL;
}
extern "C" {
    pub fn WTSVirtualChannelPurgeOutput(hChannelHandle: HANDLE) -> BOOL;
}
extern "C" {
    pub fn WTSVirtualChannelQuery(
        hChannelHandle: HANDLE,
        WtsVirtualClass: WTS_VIRTUAL_CLASS,
        ppBuffer: *mut PVOID,
        pBytesReturned: *mut DWORD,
    ) -> BOOL;
}
pub type WTS_STOP_REMOTE_CONTROL_SESSION_FN =
    ::std::option::Option<unsafe extern "C" fn(LogonId: ULONG) -> BOOL>;
pub type WTS_START_REMOTE_CONTROL_SESSION_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        pTargetServerName: LPWSTR,
        TargetLogonId: ULONG,
        HotkeyVk: BYTE,
        HotkeyModifiers: USHORT,
    ) -> BOOL,
>;
pub type WTS_START_REMOTE_CONTROL_SESSION_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        pTargetServerName: LPSTR,
        TargetLogonId: ULONG,
        HotkeyVk: BYTE,
        HotkeyModifiers: USHORT,
    ) -> BOOL,
>;
pub type WTS_START_REMOTE_CONTROL_SESSION_EX_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        pTargetServerName: LPWSTR,
        TargetLogonId: ULONG,
        HotkeyVk: BYTE,
        HotkeyModifiers: USHORT,
        flags: DWORD,
    ) -> BOOL,
>;
pub type WTS_START_REMOTE_CONTROL_SESSION_EX_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        pTargetServerName: LPSTR,
        TargetLogonId: ULONG,
        HotkeyVk: BYTE,
        HotkeyModifiers: USHORT,
        flags: DWORD,
    ) -> BOOL,
>;
pub type WTS_CONNECT_SESSION_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        LogonId: ULONG,
        TargetLogonId: ULONG,
        pPassword: PWSTR,
        bWait: BOOL,
    ) -> BOOL,
>;
pub type WTS_CONNECT_SESSION_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        LogonId: ULONG,
        TargetLogonId: ULONG,
        pPassword: PSTR,
        bWait: BOOL,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_SERVERS_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        pDomainName: LPWSTR,
        Reserved: DWORD,
        Version: DWORD,
        ppServerInfo: *mut PWTS_SERVER_INFOW,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_SERVERS_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        pDomainName: LPSTR,
        Reserved: DWORD,
        Version: DWORD,
        ppServerInfo: *mut PWTS_SERVER_INFOA,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_OPEN_SERVER_FN_W =
    ::std::option::Option<unsafe extern "C" fn(pServerName: LPWSTR) -> HANDLE>;
pub type WTS_OPEN_SERVER_FN_A =
    ::std::option::Option<unsafe extern "C" fn(pServerName: LPSTR) -> HANDLE>;
pub type WTS_OPEN_SERVER_EX_FN_W =
    ::std::option::Option<unsafe extern "C" fn(pServerName: LPWSTR) -> HANDLE>;
pub type WTS_OPEN_SERVER_EX_FN_A =
    ::std::option::Option<unsafe extern "C" fn(pServerName: LPSTR) -> HANDLE>;
pub type WTS_CLOSE_SERVER_FN = ::std::option::Option<unsafe extern "C" fn(hServer: HANDLE)>;
pub type WTS_ENUMERATE_SESSIONS_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        Reserved: DWORD,
        Version: DWORD,
        ppSessionInfo: *mut PWTS_SESSION_INFOW,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_SESSIONS_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        Reserved: DWORD,
        Version: DWORD,
        ppSessionInfo: *mut PWTS_SESSION_INFOA,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_SESSIONS_EX_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pLevel: *mut DWORD,
        Filter: DWORD,
        ppSessionInfo: *mut PWTS_SESSION_INFO_1W,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_SESSIONS_EX_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pLevel: *mut DWORD,
        Filter: DWORD,
        ppSessionInfo: *mut PWTS_SESSION_INFO_1A,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_PROCESSES_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        Reserved: DWORD,
        Version: DWORD,
        ppProcessInfo: *mut PWTS_PROCESS_INFOW,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_PROCESSES_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        Reserved: DWORD,
        Version: DWORD,
        ppProcessInfo: *mut PWTS_PROCESS_INFOA,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_TERMINATE_PROCESS_FN = ::std::option::Option<
    unsafe extern "C" fn(hServer: HANDLE, ProcessId: DWORD, ExitCode: DWORD) -> BOOL,
>;
pub type WTS_QUERY_SESSION_INFORMATION_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        SessionId: DWORD,
        WTSInfoClass: WTS_INFO_CLASS,
        ppBuffer: *mut LPWSTR,
        pBytesReturned: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_QUERY_SESSION_INFORMATION_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        SessionId: DWORD,
        WTSInfoClass: WTS_INFO_CLASS,
        ppBuffer: *mut LPSTR,
        pBytesReturned: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_QUERY_USER_CONFIG_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        pServerName: LPWSTR,
        pUserName: LPWSTR,
        WTSConfigClass: WTS_CONFIG_CLASS,
        ppBuffer: *mut LPWSTR,
        pBytesReturned: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_QUERY_USER_CONFIG_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        pServerName: LPSTR,
        pUserName: LPSTR,
        WTSConfigClass: WTS_CONFIG_CLASS,
        ppBuffer: *mut LPSTR,
        pBytesReturned: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_SET_USER_CONFIG_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        pServerName: LPWSTR,
        pUserName: LPWSTR,
        WTSConfigClass: WTS_CONFIG_CLASS,
        pBuffer: LPWSTR,
        DataLength: DWORD,
    ) -> BOOL,
>;
pub type WTS_SET_USER_CONFIG_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        pServerName: LPSTR,
        pUserName: LPSTR,
        WTSConfigClass: WTS_CONFIG_CLASS,
        pBuffer: LPSTR,
        DataLength: DWORD,
    ) -> BOOL,
>;
pub type WTS_SEND_MESSAGE_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        SessionId: DWORD,
        pTitle: LPWSTR,
        TitleLength: DWORD,
        pMessage: LPWSTR,
        MessageLength: DWORD,
        Style: DWORD,
        Timeout: DWORD,
        pResponse: *mut DWORD,
        bWait: BOOL,
    ) -> BOOL,
>;
pub type WTS_SEND_MESSAGE_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        SessionId: DWORD,
        pTitle: LPSTR,
        TitleLength: DWORD,
        pMessage: LPSTR,
        MessageLength: DWORD,
        Style: DWORD,
        Timeout: DWORD,
        pResponse: *mut DWORD,
        bWait: BOOL,
    ) -> BOOL,
>;
pub type WTS_DISCONNECT_SESSION_FN = ::std::option::Option<
    unsafe extern "C" fn(hServer: HANDLE, SessionId: DWORD, bWait: BOOL) -> BOOL,
>;
pub type WTS_LOGOFF_SESSION_FN = ::std::option::Option<
    unsafe extern "C" fn(hServer: HANDLE, SessionId: DWORD, bWait: BOOL) -> BOOL,
>;
pub type WTS_SHUTDOWN_SYSTEM_FN =
    ::std::option::Option<unsafe extern "C" fn(hServer: HANDLE, ShutdownFlag: DWORD) -> BOOL>;
pub type WTS_WAIT_SYSTEM_EVENT_FN = ::std::option::Option<
    unsafe extern "C" fn(hServer: HANDLE, EventMask: DWORD, pEventFlags: *mut DWORD) -> BOOL,
>;
pub type WTS_VIRTUAL_CHANNEL_OPEN_FN = ::std::option::Option<
    unsafe extern "C" fn(hServer: HANDLE, SessionId: DWORD, pVirtualName: LPSTR) -> HANDLE,
>;
pub type WTS_VIRTUAL_CHANNEL_OPEN_EX_FN = ::std::option::Option<
    unsafe extern "C" fn(SessionId: DWORD, pVirtualName: LPSTR, flags: DWORD) -> HANDLE,
>;
pub type WTS_VIRTUAL_CHANNEL_CLOSE_FN =
    ::std::option::Option<unsafe extern "C" fn(hChannelHandle: HANDLE) -> BOOL>;
pub type WTS_VIRTUAL_CHANNEL_READ_FN = ::std::option::Option<
    unsafe extern "C" fn(
        hChannelHandle: HANDLE,
        TimeOut: ULONG,
        Buffer: PCHAR,
        BufferSize: ULONG,
        pBytesRead: PULONG,
    ) -> BOOL,
>;
pub type WTS_VIRTUAL_CHANNEL_WRITE_FN = ::std::option::Option<
    unsafe extern "C" fn(
        hChannelHandle: HANDLE,
        Buffer: PCHAR,
        Length: ULONG,
        pBytesWritten: PULONG,
    ) -> BOOL,
>;
pub type WTS_VIRTUAL_CHANNEL_PURGE_INPUT_FN =
    ::std::option::Option<unsafe extern "C" fn(hChannelHandle: HANDLE) -> BOOL>;
pub type WTS_VIRTUAL_CHANNEL_PURGE_OUTPUT_FN =
    ::std::option::Option<unsafe extern "C" fn(hChannelHandle: HANDLE) -> BOOL>;
pub type WTS_VIRTUAL_CHANNEL_QUERY_FN = ::std::option::Option<
    unsafe extern "C" fn(
        hChannelHandle: HANDLE,
        WtsVirtualClass: WTS_VIRTUAL_CLASS,
        ppBuffer: *mut PVOID,
        pBytesReturned: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_FREE_MEMORY_FN = ::std::option::Option<unsafe extern "C" fn(pMemory: PVOID)>;
pub type WTS_REGISTER_SESSION_NOTIFICATION_FN =
    ::std::option::Option<unsafe extern "C" fn(hWnd: HWND, dwFlags: DWORD) -> BOOL>;
pub type WTS_UNREGISTER_SESSION_NOTIFICATION_FN =
    ::std::option::Option<unsafe extern "C" fn(hWnd: HWND) -> BOOL>;
pub type WTS_REGISTER_SESSION_NOTIFICATION_EX_FN = ::std::option::Option<
    unsafe extern "C" fn(hServer: HANDLE, hWnd: HWND, dwFlags: DWORD) -> BOOL,
>;
pub type WTS_UNREGISTER_SESSION_NOTIFICATION_EX_FN =
    ::std::option::Option<unsafe extern "C" fn(hServer: HANDLE, hWnd: HWND) -> BOOL>;
pub type WTS_QUERY_USER_TOKEN_FN =
    ::std::option::Option<unsafe extern "C" fn(SessionId: ULONG, phToken: PHANDLE) -> BOOL>;
pub type WTS_FREE_MEMORY_EX_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        WTSTypeClass: WTS_TYPE_CLASS,
        pMemory: PVOID,
        NumberOfEntries: ULONG,
    ) -> BOOL,
>;
pub type WTS_FREE_MEMORY_EX_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        WTSTypeClass: WTS_TYPE_CLASS,
        pMemory: PVOID,
        NumberOfEntries: ULONG,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_PROCESSES_EX_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pLevel: *mut DWORD,
        SessionId: DWORD,
        ppProcessInfo: *mut LPWSTR,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_PROCESSES_EX_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pLevel: *mut DWORD,
        SessionId: DWORD,
        ppProcessInfo: *mut LPSTR,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_LISTENERS_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListeners: PWTSLISTENERNAMEW,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_ENUMERATE_LISTENERS_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListeners: PWTSLISTENERNAMEA,
        pCount: *mut DWORD,
    ) -> BOOL,
>;
pub type WTS_QUERY_LISTENER_CONFIG_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPWSTR,
        pBuffer: PWTSLISTENERCONFIGW,
    ) -> BOOL,
>;
pub type WTS_QUERY_LISTENER_CONFIG_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPSTR,
        pBuffer: PWTSLISTENERCONFIGA,
    ) -> BOOL,
>;
pub type WTS_CREATE_LISTENER_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPWSTR,
        pBuffer: PWTSLISTENERCONFIGW,
        flag: DWORD,
    ) -> BOOL,
>;
pub type WTS_CREATE_LISTENER_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPSTR,
        pBuffer: PWTSLISTENERCONFIGA,
        flag: DWORD,
    ) -> BOOL,
>;
pub type WTS_SET_LISTENER_SECURITY_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPWSTR,
        SecurityInformation: SECURITY_INFORMATION,
        pSecurityDescriptor: PSECURITY_DESCRIPTOR,
    ) -> BOOL,
>;
pub type WTS_SET_LISTENER_SECURITY_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPSTR,
        SecurityInformation: SECURITY_INFORMATION,
        pSecurityDescriptor: PSECURITY_DESCRIPTOR,
    ) -> BOOL,
>;
pub type WTS_GET_LISTENER_SECURITY_FN_W = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPWSTR,
        SecurityInformation: SECURITY_INFORMATION,
        pSecurityDescriptor: PSECURITY_DESCRIPTOR,
        nLength: DWORD,
        lpnLengthNeeded: LPDWORD,
    ) -> BOOL,
>;
pub type WTS_GET_LISTENER_SECURITY_FN_A = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        pReserved: PVOID,
        Reserved: DWORD,
        pListenerName: LPSTR,
        SecurityInformation: SECURITY_INFORMATION,
        pSecurityDescriptor: PSECURITY_DESCRIPTOR,
        nLength: DWORD,
        lpnLengthNeeded: LPDWORD,
    ) -> BOOL,
>;
pub type WTS_ENABLE_CHILD_SESSIONS_FN =
    ::std::option::Option<unsafe extern "C" fn(bEnable: BOOL) -> BOOL>;
pub type WTS_IS_CHILD_SESSIONS_ENABLED_FN =
    ::std::option::Option<unsafe extern "C" fn(pbEnabled: PBOOL) -> BOOL>;
pub type WTS_GET_CHILD_SESSION_ID_FN =
    ::std::option::Option<unsafe extern "C" fn(pSessionId: PULONG) -> BOOL>;
pub type WTS_GET_ACTIVE_CONSOLE_SESSION_ID_FN =
    ::std::option::Option<unsafe extern "C" fn() -> DWORD>;
pub type WTS_LOGON_USER_FN = ::std::option::Option<
    unsafe extern "C" fn(
        hServer: HANDLE,
        username: LPCSTR,
        password: LPCSTR,
        domain: LPCSTR,
    ) -> BOOL,
>;
pub type WTS_LOGOFF_USER_FN = ::std::option::Option<unsafe extern "C" fn(hServer: HANDLE) -> BOOL>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WtsApiFunctionTable {
    pub dwVersion: DWORD,
    pub dwFlags: DWORD,
    pub pStopRemoteControlSession: WTS_STOP_REMOTE_CONTROL_SESSION_FN,
    pub pStartRemoteControlSessionW: WTS_START_REMOTE_CONTROL_SESSION_FN_W,
    pub pStartRemoteControlSessionA: WTS_START_REMOTE_CONTROL_SESSION_FN_A,
    pub pConnectSessionW: WTS_CONNECT_SESSION_FN_W,
    pub pConnectSessionA: WTS_CONNECT_SESSION_FN_A,
    pub pEnumerateServersW: WTS_ENUMERATE_SERVERS_FN_W,
    pub pEnumerateServersA: WTS_ENUMERATE_SERVERS_FN_A,
    pub pOpenServerW: WTS_OPEN_SERVER_FN_W,
    pub pOpenServerA: WTS_OPEN_SERVER_FN_A,
    pub pOpenServerExW: WTS_OPEN_SERVER_EX_FN_W,
    pub pOpenServerExA: WTS_OPEN_SERVER_EX_FN_A,
    pub pCloseServer: WTS_CLOSE_SERVER_FN,
    pub pEnumerateSessionsW: WTS_ENUMERATE_SESSIONS_FN_W,
    pub pEnumerateSessionsA: WTS_ENUMERATE_SESSIONS_FN_A,
    pub pEnumerateSessionsExW: WTS_ENUMERATE_SESSIONS_EX_FN_W,
    pub pEnumerateSessionsExA: WTS_ENUMERATE_SESSIONS_EX_FN_A,
    pub pEnumerateProcessesW: WTS_ENUMERATE_PROCESSES_FN_W,
    pub pEnumerateProcessesA: WTS_ENUMERATE_PROCESSES_FN_A,
    pub pTerminateProcess: WTS_TERMINATE_PROCESS_FN,
    pub pQuerySessionInformationW: WTS_QUERY_SESSION_INFORMATION_FN_W,
    pub pQuerySessionInformationA: WTS_QUERY_SESSION_INFORMATION_FN_A,
    pub pQueryUserConfigW: WTS_QUERY_USER_CONFIG_FN_W,
    pub pQueryUserConfigA: WTS_QUERY_USER_CONFIG_FN_A,
    pub pSetUserConfigW: WTS_SET_USER_CONFIG_FN_W,
    pub pSetUserConfigA: WTS_SET_USER_CONFIG_FN_A,
    pub pSendMessageW: WTS_SEND_MESSAGE_FN_W,
    pub pSendMessageA: WTS_SEND_MESSAGE_FN_A,
    pub pDisconnectSession: WTS_DISCONNECT_SESSION_FN,
    pub pLogoffSession: WTS_LOGOFF_SESSION_FN,
    pub pShutdownSystem: WTS_SHUTDOWN_SYSTEM_FN,
    pub pWaitSystemEvent: WTS_WAIT_SYSTEM_EVENT_FN,
    pub pVirtualChannelOpen: WTS_VIRTUAL_CHANNEL_OPEN_FN,
    pub pVirtualChannelOpenEx: WTS_VIRTUAL_CHANNEL_OPEN_EX_FN,
    pub pVirtualChannelClose: WTS_VIRTUAL_CHANNEL_CLOSE_FN,
    pub pVirtualChannelRead: WTS_VIRTUAL_CHANNEL_READ_FN,
    pub pVirtualChannelWrite: WTS_VIRTUAL_CHANNEL_WRITE_FN,
    pub pVirtualChannelPurgeInput: WTS_VIRTUAL_CHANNEL_PURGE_INPUT_FN,
    pub pVirtualChannelPurgeOutput: WTS_VIRTUAL_CHANNEL_PURGE_OUTPUT_FN,
    pub pVirtualChannelQuery: WTS_VIRTUAL_CHANNEL_QUERY_FN,
    pub pFreeMemory: WTS_FREE_MEMORY_FN,
    pub pRegisterSessionNotification: WTS_REGISTER_SESSION_NOTIFICATION_FN,
    pub pUnRegisterSessionNotification: WTS_UNREGISTER_SESSION_NOTIFICATION_FN,
    pub pRegisterSessionNotificationEx: WTS_REGISTER_SESSION_NOTIFICATION_EX_FN,
    pub pUnRegisterSessionNotificationEx: WTS_UNREGISTER_SESSION_NOTIFICATION_EX_FN,
    pub pQueryUserToken: WTS_QUERY_USER_TOKEN_FN,
    pub pFreeMemoryExW: WTS_FREE_MEMORY_EX_FN_W,
    pub pFreeMemoryExA: WTS_FREE_MEMORY_EX_FN_A,
    pub pEnumerateProcessesExW: WTS_ENUMERATE_PROCESSES_EX_FN_W,
    pub pEnumerateProcessesExA: WTS_ENUMERATE_PROCESSES_EX_FN_A,
    pub pEnumerateListenersW: WTS_ENUMERATE_LISTENERS_FN_W,
    pub pEnumerateListenersA: WTS_ENUMERATE_LISTENERS_FN_A,
    pub pQueryListenerConfigW: WTS_QUERY_LISTENER_CONFIG_FN_W,
    pub pQueryListenerConfigA: WTS_QUERY_LISTENER_CONFIG_FN_A,
    pub pCreateListenerW: WTS_CREATE_LISTENER_FN_W,
    pub pCreateListenerA: WTS_CREATE_LISTENER_FN_A,
    pub pSetListenerSecurityW: WTS_SET_LISTENER_SECURITY_FN_W,
    pub pSetListenerSecurityA: WTS_SET_LISTENER_SECURITY_FN_A,
    pub pGetListenerSecurityW: WTS_GET_LISTENER_SECURITY_FN_W,
    pub pGetListenerSecurityA: WTS_GET_LISTENER_SECURITY_FN_A,
    pub pEnableChildSessions: WTS_ENABLE_CHILD_SESSIONS_FN,
    pub pIsChildSessionsEnabled: WTS_IS_CHILD_SESSIONS_ENABLED_FN,
    pub pGetChildSessionId: WTS_GET_CHILD_SESSION_ID_FN,
    pub pGetActiveConsoleSessionId: WTS_GET_ACTIVE_CONSOLE_SESSION_ID_FN,
    pub pLogonUser: WTS_LOGON_USER_FN,
    pub pLogoffUser: WTS_LOGOFF_USER_FN,
    pub pStartRemoteControlSessionExW: WTS_START_REMOTE_CONTROL_SESSION_EX_FN_W,
    pub pStartRemoteControlSessionExA: WTS_START_REMOTE_CONTROL_SESSION_EX_FN_A,
}
#[test]
fn bindgen_test_layout__WtsApiFunctionTable() {
    assert_eq!(
        ::std::mem::size_of::<_WtsApiFunctionTable>(),
        544usize,
        concat!("Size of: ", stringify!(_WtsApiFunctionTable))
    );
    assert_eq!(
        ::std::mem::align_of::<_WtsApiFunctionTable>(),
        8usize,
        concat!("Alignment of ", stringify!(_WtsApiFunctionTable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WtsApiFunctionTable>())).dwVersion as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(dwVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WtsApiFunctionTable>())).dwFlags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(dwFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pStopRemoteControlSession as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pStopRemoteControlSession)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pStartRemoteControlSessionW as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pStartRemoteControlSessionW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pStartRemoteControlSessionA as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pStartRemoteControlSessionA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pConnectSessionW as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pConnectSessionW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pConnectSessionA as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pConnectSessionA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateServersW as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateServersW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateServersA as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateServersA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pOpenServerW as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pOpenServerW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pOpenServerA as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pOpenServerA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pOpenServerExW as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pOpenServerExW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pOpenServerExA as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pOpenServerExA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pCloseServer as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pCloseServer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateSessionsW as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateSessionsW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateSessionsA as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateSessionsA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateSessionsExW as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateSessionsExW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateSessionsExA as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateSessionsExA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateProcessesW as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateProcessesW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateProcessesA as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateProcessesA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pTerminateProcess as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pTerminateProcess)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQuerySessionInformationW as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQuerySessionInformationW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQuerySessionInformationA as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQuerySessionInformationA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQueryUserConfigW as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQueryUserConfigW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQueryUserConfigA as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQueryUserConfigA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pSetUserConfigW as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pSetUserConfigW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pSetUserConfigA as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pSetUserConfigA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pSendMessageW as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pSendMessageW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pSendMessageA as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pSendMessageA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pDisconnectSession as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pDisconnectSession)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pLogoffSession as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pLogoffSession)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pShutdownSystem as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pShutdownSystem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pWaitSystemEvent as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pWaitSystemEvent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelOpen as *const _
                as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelOpen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelOpenEx as *const _
                as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelOpenEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelClose as *const _
                as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelClose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelRead as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelRead)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelWrite as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelWrite)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelPurgeInput as *const _
                as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelPurgeInput)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelPurgeOutput as *const _
                as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelPurgeOutput)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pVirtualChannelQuery as *const _
                as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pVirtualChannelQuery)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pFreeMemory as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pFreeMemory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pRegisterSessionNotification
                as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pRegisterSessionNotification)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pUnRegisterSessionNotification
                as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pUnRegisterSessionNotification)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pRegisterSessionNotificationEx
                as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pRegisterSessionNotificationEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pUnRegisterSessionNotificationEx
                as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pUnRegisterSessionNotificationEx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQueryUserToken as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQueryUserToken)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pFreeMemoryExW as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pFreeMemoryExW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pFreeMemoryExA as *const _ as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pFreeMemoryExA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateProcessesExW as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateProcessesExW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateProcessesExA as *const _
                as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateProcessesExA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateListenersW as *const _
                as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateListenersW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnumerateListenersA as *const _
                as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnumerateListenersA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQueryListenerConfigW as *const _
                as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQueryListenerConfigW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pQueryListenerConfigA as *const _
                as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pQueryListenerConfigA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pCreateListenerW as *const _ as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pCreateListenerW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pCreateListenerA as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pCreateListenerA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pSetListenerSecurityW as *const _
                as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pSetListenerSecurityW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pSetListenerSecurityA as *const _
                as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pSetListenerSecurityA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pGetListenerSecurityW as *const _
                as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pGetListenerSecurityW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pGetListenerSecurityA as *const _
                as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pGetListenerSecurityA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pEnableChildSessions as *const _
                as usize
        },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pEnableChildSessions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pIsChildSessionsEnabled as *const _
                as usize
        },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pIsChildSessionsEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pGetChildSessionId as *const _ as usize
        },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pGetChildSessionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pGetActiveConsoleSessionId as *const _
                as usize
        },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pGetActiveConsoleSessionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pLogonUser as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pLogonUser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pLogoffUser as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pLogoffUser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pStartRemoteControlSessionExW
                as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pStartRemoteControlSessionExW)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_WtsApiFunctionTable>())).pStartRemoteControlSessionExA
                as *const _ as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(_WtsApiFunctionTable),
            "::",
            stringify!(pStartRemoteControlSessionExA)
        )
    );
}
pub type WtsApiFunctionTable = _WtsApiFunctionTable;
pub type PWtsApiFunctionTable = *mut WtsApiFunctionTable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PALETTE_ENTRY {
    pub red: BYTE,
    pub green: BYTE,
    pub blue: BYTE,
}
#[test]
fn bindgen_test_layout__PALETTE_ENTRY() {
    assert_eq!(
        ::std::mem::size_of::<_PALETTE_ENTRY>(),
        3usize,
        concat!("Size of: ", stringify!(_PALETTE_ENTRY))
    );
    assert_eq!(
        ::std::mem::align_of::<_PALETTE_ENTRY>(),
        1usize,
        concat!("Alignment of ", stringify!(_PALETTE_ENTRY))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PALETTE_ENTRY>())).red as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PALETTE_ENTRY),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PALETTE_ENTRY>())).green as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_PALETTE_ENTRY),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_PALETTE_ENTRY>())).blue as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_PALETTE_ENTRY),
            "::",
            stringify!(blue)
        )
    );
}
pub type PALETTE_ENTRY = _PALETTE_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TIME_ZONE_INFORMATION {
    pub Bias: LONG,
    pub StandardName: [WCHAR; 32usize],
    pub StandardDate: SYSTEMTIME,
    pub StandardBias: LONG,
    pub DaylightName: [WCHAR; 32usize],
    pub DaylightDate: SYSTEMTIME,
    pub DaylightBias: LONG,
}
#[test]
fn bindgen_test_layout__TIME_ZONE_INFORMATION() {
    assert_eq!(
        ::std::mem::size_of::<_TIME_ZONE_INFORMATION>(),
        172usize,
        concat!("Size of: ", stringify!(_TIME_ZONE_INFORMATION))
    );
    assert_eq!(
        ::std::mem::align_of::<_TIME_ZONE_INFORMATION>(),
        4usize,
        concat!("Alignment of ", stringify!(_TIME_ZONE_INFORMATION))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).Bias as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(Bias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).StandardName as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(StandardName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).StandardDate as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(StandardDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).StandardBias as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(StandardBias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).DaylightName as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(DaylightName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).DaylightDate as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(DaylightDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_ZONE_INFORMATION>())).DaylightBias as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_ZONE_INFORMATION),
            "::",
            stringify!(DaylightBias)
        )
    );
}
pub type TIME_ZONE_INFORMATION = _TIME_ZONE_INFORMATION;
pub type LPTIME_ZONE_INFORMATION = *mut _TIME_ZONE_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TIME_DYNAMIC_ZONE_INFORMATION {
    pub Bias: LONG,
    pub StandardName: [WCHAR; 32usize],
    pub StandardDate: SYSTEMTIME,
    pub StandardBias: LONG,
    pub DaylightName: [WCHAR; 32usize],
    pub DaylightDate: SYSTEMTIME,
    pub DaylightBias: LONG,
    pub TimeZoneKeyName: [WCHAR; 128usize],
    pub DynamicDaylightTimeDisabled: BOOLEAN,
}
#[test]
fn bindgen_test_layout__TIME_DYNAMIC_ZONE_INFORMATION() {
    assert_eq!(
        ::std::mem::size_of::<_TIME_DYNAMIC_ZONE_INFORMATION>(),
        432usize,
        concat!("Size of: ", stringify!(_TIME_DYNAMIC_ZONE_INFORMATION))
    );
    assert_eq!(
        ::std::mem::align_of::<_TIME_DYNAMIC_ZONE_INFORMATION>(),
        4usize,
        concat!("Alignment of ", stringify!(_TIME_DYNAMIC_ZONE_INFORMATION))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).Bias as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(Bias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).StandardName as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(StandardName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).StandardDate as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(StandardDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).StandardBias as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(StandardBias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).DaylightName as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(DaylightName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).DaylightDate as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(DaylightDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).DaylightBias as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(DaylightBias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).TimeZoneKeyName as *const _
                as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(TimeZoneKeyName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_TIME_DYNAMIC_ZONE_INFORMATION>())).DynamicDaylightTimeDisabled
                as *const _ as usize
        },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(_TIME_DYNAMIC_ZONE_INFORMATION),
            "::",
            stringify!(DynamicDaylightTimeDisabled)
        )
    );
}
pub type PDYNAMIC_TIME_ZONE_INFORMATION = *mut _TIME_DYNAMIC_ZONE_INFORMATION;
extern "C" {
    pub fn GetTimeZoneInformation(lpTimeZoneInformation: LPTIME_ZONE_INFORMATION) -> DWORD;
}
extern "C" {
    pub fn GetDynamicTimeZoneInformation(
        pTimeZoneInformation: PDYNAMIC_TIME_ZONE_INFORMATION,
    ) -> DWORD;
}
extern "C" {
    pub fn GetTimeZoneInformationForYear(
        wYear: USHORT,
        pdtzi: PDYNAMIC_TIME_ZONE_INFORMATION,
        ptzi: LPTIME_ZONE_INFORMATION,
    ) -> BOOL;
}
extern "C" {
    pub fn GetDynamicTimeZoneInformationEffectiveYears(
        lpTimeZoneInformation: PDYNAMIC_TIME_ZONE_INFORMATION,
        FirstYear: LPDWORD,
        LastYear: LPDWORD,
    ) -> DWORD;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ARC_CS_PRIVATE_PACKET {
    pub cbLen: UINT32,
    pub version: UINT32,
    pub logonId: UINT32,
    pub securityVerifier: [BYTE; 16usize],
}
#[test]
fn bindgen_test_layout_ARC_CS_PRIVATE_PACKET() {
    assert_eq!(
        ::std::mem::size_of::<ARC_CS_PRIVATE_PACKET>(),
        28usize,
        concat!("Size of: ", stringify!(ARC_CS_PRIVATE_PACKET))
    );
    assert_eq!(
        ::std::mem::align_of::<ARC_CS_PRIVATE_PACKET>(),
        4usize,
        concat!("Alignment of ", stringify!(ARC_CS_PRIVATE_PACKET))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ARC_CS_PRIVATE_PACKET>())).cbLen as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_CS_PRIVATE_PACKET),
            "::",
            stringify!(cbLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ARC_CS_PRIVATE_PACKET>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_CS_PRIVATE_PACKET),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ARC_CS_PRIVATE_PACKET>())).logonId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_CS_PRIVATE_PACKET),
            "::",
            stringify!(logonId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ARC_CS_PRIVATE_PACKET>())).securityVerifier as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_CS_PRIVATE_PACKET),
            "::",
            stringify!(securityVerifier)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ARC_SC_PRIVATE_PACKET {
    pub cbLen: UINT32,
    pub version: UINT32,
    pub logonId: UINT32,
    pub arcRandomBits: [BYTE; 16usize],
}
#[test]
fn bindgen_test_layout_ARC_SC_PRIVATE_PACKET() {
    assert_eq!(
        ::std::mem::size_of::<ARC_SC_PRIVATE_PACKET>(),
        28usize,
        concat!("Size of: ", stringify!(ARC_SC_PRIVATE_PACKET))
    );
    assert_eq!(
        ::std::mem::align_of::<ARC_SC_PRIVATE_PACKET>(),
        4usize,
        concat!("Alignment of ", stringify!(ARC_SC_PRIVATE_PACKET))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ARC_SC_PRIVATE_PACKET>())).cbLen as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_SC_PRIVATE_PACKET),
            "::",
            stringify!(cbLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ARC_SC_PRIVATE_PACKET>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_SC_PRIVATE_PACKET),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ARC_SC_PRIVATE_PACKET>())).logonId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_SC_PRIVATE_PACKET),
            "::",
            stringify!(logonId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ARC_SC_PRIVATE_PACKET>())).arcRandomBits as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ARC_SC_PRIVATE_PACKET),
            "::",
            stringify!(arcRandomBits)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_CertBlob {
    pub length: UINT32,
    pub data: *mut BYTE,
}
#[test]
fn bindgen_test_layout_rdp_CertBlob() {
    assert_eq!(
        ::std::mem::size_of::<rdp_CertBlob>(),
        16usize,
        concat!("Size of: ", stringify!(rdp_CertBlob))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_CertBlob>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_CertBlob))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_CertBlob>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_CertBlob),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_CertBlob>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_CertBlob),
            "::",
            stringify!(data)
        )
    );
}
pub type rdpCertBlob = rdp_CertBlob;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_X509CertChain {
    pub count: UINT32,
    pub array: *mut rdpCertBlob,
}
#[test]
fn bindgen_test_layout_rdp_X509CertChain() {
    assert_eq!(
        ::std::mem::size_of::<rdp_X509CertChain>(),
        16usize,
        concat!("Size of: ", stringify!(rdp_X509CertChain))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_X509CertChain>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_X509CertChain))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_X509CertChain>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_X509CertChain),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_X509CertChain>())).array as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_X509CertChain),
            "::",
            stringify!(array)
        )
    );
}
pub type rdpX509CertChain = rdp_X509CertChain;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_CertInfo {
    pub Modulus: *mut BYTE,
    pub ModulusLength: DWORD,
    pub exponent: [BYTE; 4usize],
}
#[test]
fn bindgen_test_layout_rdp_CertInfo() {
    assert_eq!(
        ::std::mem::size_of::<rdp_CertInfo>(),
        16usize,
        concat!("Size of: ", stringify!(rdp_CertInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_CertInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_CertInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_CertInfo>())).Modulus as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_CertInfo),
            "::",
            stringify!(Modulus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_CertInfo>())).ModulusLength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_CertInfo),
            "::",
            stringify!(ModulusLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_CertInfo>())).exponent as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_CertInfo),
            "::",
            stringify!(exponent)
        )
    );
}
pub type rdpCertInfo = rdp_CertInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_certificate {
    pub cert_info: rdpCertInfo,
    pub x509_cert_chain: *mut rdpX509CertChain,
}
#[test]
fn bindgen_test_layout_rdp_certificate() {
    assert_eq!(
        ::std::mem::size_of::<rdp_certificate>(),
        24usize,
        concat!("Size of: ", stringify!(rdp_certificate))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_certificate>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_certificate))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_certificate>())).cert_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_certificate),
            "::",
            stringify!(cert_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_certificate>())).x509_cert_chain as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_certificate),
            "::",
            stringify!(x509_cert_chain)
        )
    );
}
pub type rdpCertificate = rdp_certificate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_rsa_key {
    pub Modulus: *mut BYTE,
    pub ModulusLength: DWORD,
    pub PrivateExponent: *mut BYTE,
    pub PrivateExponentLength: DWORD,
    pub exponent: [BYTE; 4usize],
}
#[test]
fn bindgen_test_layout_rdp_rsa_key() {
    assert_eq!(
        ::std::mem::size_of::<rdp_rsa_key>(),
        32usize,
        concat!("Size of: ", stringify!(rdp_rsa_key))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_rsa_key>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_rsa_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_rsa_key>())).Modulus as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_rsa_key),
            "::",
            stringify!(Modulus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_rsa_key>())).ModulusLength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_rsa_key),
            "::",
            stringify!(ModulusLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_rsa_key>())).PrivateExponent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_rsa_key),
            "::",
            stringify!(PrivateExponent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_rsa_key>())).PrivateExponentLength as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_rsa_key),
            "::",
            stringify!(PrivateExponentLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_rsa_key>())).exponent as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_rsa_key),
            "::",
            stringify!(exponent)
        )
    );
}
pub type rdpRsaKey = rdp_rsa_key;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ADDIN_ARGV {
    pub argc: ::std::os::raw::c_int,
    pub argv: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__ADDIN_ARGV() {
    assert_eq!(
        ::std::mem::size_of::<_ADDIN_ARGV>(),
        16usize,
        concat!("Size of: ", stringify!(_ADDIN_ARGV))
    );
    assert_eq!(
        ::std::mem::align_of::<_ADDIN_ARGV>(),
        8usize,
        concat!("Alignment of ", stringify!(_ADDIN_ARGV))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ADDIN_ARGV>())).argc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ADDIN_ARGV),
            "::",
            stringify!(argc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_ADDIN_ARGV>())).argv as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ADDIN_ARGV),
            "::",
            stringify!(argv)
        )
    );
}
pub type ADDIN_ARGV = _ADDIN_ARGV;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_ext_set {
    pub name: [::std::os::raw::c_char; 256usize],
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rdp_ext_set() {
    assert_eq!(
        ::std::mem::size_of::<rdp_ext_set>(),
        264usize,
        concat!("Size of: ", stringify!(rdp_ext_set))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_ext_set>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_ext_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_ext_set>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_ext_set),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_ext_set>())).data as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_ext_set),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _BITMAP_CACHE_V2_CELL_INFO {
    pub numEntries: UINT32,
    pub persistent: BOOL,
}
#[test]
fn bindgen_test_layout__BITMAP_CACHE_V2_CELL_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_BITMAP_CACHE_V2_CELL_INFO>(),
        8usize,
        concat!("Size of: ", stringify!(_BITMAP_CACHE_V2_CELL_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_BITMAP_CACHE_V2_CELL_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(_BITMAP_CACHE_V2_CELL_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_BITMAP_CACHE_V2_CELL_INFO>())).numEntries as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_BITMAP_CACHE_V2_CELL_INFO),
            "::",
            stringify!(numEntries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_BITMAP_CACHE_V2_CELL_INFO>())).persistent as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_BITMAP_CACHE_V2_CELL_INFO),
            "::",
            stringify!(persistent)
        )
    );
}
pub type BITMAP_CACHE_V2_CELL_INFO = _BITMAP_CACHE_V2_CELL_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GLYPH_CACHE_DEFINITION {
    pub cacheEntries: UINT16,
    pub cacheMaximumCellSize: UINT16,
}
#[test]
fn bindgen_test_layout__GLYPH_CACHE_DEFINITION() {
    assert_eq!(
        ::std::mem::size_of::<_GLYPH_CACHE_DEFINITION>(),
        4usize,
        concat!("Size of: ", stringify!(_GLYPH_CACHE_DEFINITION))
    );
    assert_eq!(
        ::std::mem::align_of::<_GLYPH_CACHE_DEFINITION>(),
        2usize,
        concat!("Alignment of ", stringify!(_GLYPH_CACHE_DEFINITION))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_GLYPH_CACHE_DEFINITION>())).cacheEntries as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_GLYPH_CACHE_DEFINITION),
            "::",
            stringify!(cacheEntries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_GLYPH_CACHE_DEFINITION>())).cacheMaximumCellSize as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_GLYPH_CACHE_DEFINITION),
            "::",
            stringify!(cacheMaximumCellSize)
        )
    );
}
pub type GLYPH_CACHE_DEFINITION = _GLYPH_CACHE_DEFINITION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MONITOR_DEF {
    pub left: INT32,
    pub top: INT32,
    pub right: INT32,
    pub bottom: INT32,
    pub flags: UINT32,
}
#[test]
fn bindgen_test_layout__MONITOR_DEF() {
    assert_eq!(
        ::std::mem::size_of::<_MONITOR_DEF>(),
        20usize,
        concat!("Size of: ", stringify!(_MONITOR_DEF))
    );
    assert_eq!(
        ::std::mem::align_of::<_MONITOR_DEF>(),
        4usize,
        concat!("Alignment of ", stringify!(_MONITOR_DEF))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MONITOR_DEF>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_DEF),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MONITOR_DEF>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_DEF),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MONITOR_DEF>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_DEF),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MONITOR_DEF>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_DEF),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MONITOR_DEF>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_DEF),
            "::",
            stringify!(flags)
        )
    );
}
pub type MONITOR_DEF = _MONITOR_DEF;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MONITOR_ATTRIBUTES {
    pub physicalWidth: UINT32,
    pub physicalHeight: UINT32,
    pub orientation: UINT32,
    pub desktopScaleFactor: UINT32,
    pub deviceScaleFactor: UINT32,
}
#[test]
fn bindgen_test_layout__MONITOR_ATTRIBUTES() {
    assert_eq!(
        ::std::mem::size_of::<_MONITOR_ATTRIBUTES>(),
        20usize,
        concat!("Size of: ", stringify!(_MONITOR_ATTRIBUTES))
    );
    assert_eq!(
        ::std::mem::align_of::<_MONITOR_ATTRIBUTES>(),
        4usize,
        concat!("Alignment of ", stringify!(_MONITOR_ATTRIBUTES))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_MONITOR_ATTRIBUTES>())).physicalWidth as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_ATTRIBUTES),
            "::",
            stringify!(physicalWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_MONITOR_ATTRIBUTES>())).physicalHeight as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_ATTRIBUTES),
            "::",
            stringify!(physicalHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MONITOR_ATTRIBUTES>())).orientation as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_ATTRIBUTES),
            "::",
            stringify!(orientation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_MONITOR_ATTRIBUTES>())).desktopScaleFactor as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_ATTRIBUTES),
            "::",
            stringify!(desktopScaleFactor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_MONITOR_ATTRIBUTES>())).deviceScaleFactor as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_MONITOR_ATTRIBUTES),
            "::",
            stringify!(deviceScaleFactor)
        )
    );
}
pub type MONITOR_ATTRIBUTES = _MONITOR_ATTRIBUTES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_monitor {
    pub x: INT32,
    pub y: INT32,
    pub width: INT32,
    pub height: INT32,
    pub is_primary: UINT32,
    pub orig_screen: UINT32,
    pub attributes: MONITOR_ATTRIBUTES,
}
#[test]
fn bindgen_test_layout_rdp_monitor() {
    assert_eq!(
        ::std::mem::size_of::<rdp_monitor>(),
        44usize,
        concat!("Size of: ", stringify!(rdp_monitor))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_monitor>(),
        4usize,
        concat!("Alignment of ", stringify!(rdp_monitor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).is_primary as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(is_primary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).orig_screen as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(orig_screen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_monitor>())).attributes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_monitor),
            "::",
            stringify!(attributes)
        )
    );
}
pub type rdpMonitor = rdp_monitor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RDPDR_DEVICE {
    pub Id: UINT32,
    pub Type: UINT32,
    pub Name: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__RDPDR_DEVICE() {
    assert_eq!(
        ::std::mem::size_of::<_RDPDR_DEVICE>(),
        16usize,
        concat!("Size of: ", stringify!(_RDPDR_DEVICE))
    );
    assert_eq!(
        ::std::mem::align_of::<_RDPDR_DEVICE>(),
        8usize,
        concat!("Alignment of ", stringify!(_RDPDR_DEVICE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RDPDR_DEVICE>())).Id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RDPDR_DEVICE),
            "::",
            stringify!(Id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RDPDR_DEVICE>())).Type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_RDPDR_DEVICE),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RDPDR_DEVICE>())).Name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_RDPDR_DEVICE),
            "::",
            stringify!(Name)
        )
    );
}
pub type RDPDR_DEVICE = _RDPDR_DEVICE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rdp_settings {
    #[doc = " WARNING: this data structure is carefully padded for ABI stability!"]
    #[doc = " Keeping this area clean is particularly challenging, so unless you are"]
    #[doc = " a trusted developer you should NOT take the liberty of adding your own"]
    #[doc = " options straight into the ABI stable zone. Instead, append them to the"]
    #[doc = " very end of this data structure, in the zone marked as ABI unstable."]
    pub instance: *mut ::std::os::raw::c_void,
    pub padding001: [UINT64; 15usize],
    pub ServerMode: BOOL,
    pub __bindgen_padding_0: u32,
    pub ShareId: UINT32,
    pub __bindgen_padding_1: u32,
    pub PduSource: UINT32,
    pub __bindgen_padding_2: u32,
    pub ServerPort: UINT32,
    pub ServerHostname: *mut ::std::os::raw::c_char,
    pub Username: *mut ::std::os::raw::c_char,
    pub Password: *mut ::std::os::raw::c_char,
    pub Domain: *mut ::std::os::raw::c_char,
    pub PasswordHash: *mut ::std::os::raw::c_char,
    pub WaitForOutputBufferFlush: BOOL,
    pub __bindgen_padding_3: u32,
    pub MaxTimeInCheckLoop: UINT32,
    pub AcceptedCert: *mut ::std::os::raw::c_char,
    pub AcceptedCertLength: UINT32,
    pub padding0064: [UINT64; 35usize],
    pub padding0128: [UINT64; 64usize],
    #[doc = " GCC User Data Blocks"]
    pub RdpVersion: UINT32,
    pub __bindgen_padding_4: u32,
    pub DesktopWidth: UINT32,
    pub __bindgen_padding_5: u32,
    pub DesktopHeight: UINT32,
    pub __bindgen_padding_6: u32,
    pub ColorDepth: UINT32,
    pub __bindgen_padding_7: u32,
    pub ConnectionType: UINT32,
    pub __bindgen_padding_8: u32,
    pub ClientBuild: UINT32,
    pub ClientHostname: *mut ::std::os::raw::c_char,
    pub ClientProductId: *mut ::std::os::raw::c_char,
    pub EarlyCapabilityFlags: UINT32,
    pub __bindgen_padding_9: u32,
    pub NetworkAutoDetect: BOOL,
    pub __bindgen_padding_10: u32,
    pub SupportAsymetricKeys: BOOL,
    pub __bindgen_padding_11: u32,
    pub SupportErrorInfoPdu: BOOL,
    pub __bindgen_padding_12: u32,
    pub SupportStatusInfoPdu: BOOL,
    pub __bindgen_padding_13: u32,
    pub SupportMonitorLayoutPdu: BOOL,
    pub __bindgen_padding_14: u32,
    pub SupportGraphicsPipeline: BOOL,
    pub __bindgen_padding_15: u32,
    pub SupportDynamicTimeZone: BOOL,
    pub __bindgen_padding_16: u32,
    pub SupportHeartbeatPdu: BOOL,
    pub __bindgen_padding_17: u32,
    pub DesktopPhysicalWidth: UINT32,
    pub __bindgen_padding_18: u32,
    pub DesktopPhysicalHeight: UINT32,
    pub __bindgen_padding_19: [u16; 2usize],
    pub DesktopOrientation: UINT16,
    pub __bindgen_padding_20: u32,
    pub DesktopScaleFactor: UINT32,
    pub __bindgen_padding_21: u32,
    pub DeviceScaleFactor: UINT32,
    pub padding0192: [UINT64; 42usize],
    pub UseRdpSecurityLayer: BOOL,
    pub __bindgen_padding_22: u32,
    pub EncryptionMethods: UINT32,
    pub __bindgen_padding_23: u32,
    pub ExtEncryptionMethods: UINT32,
    pub __bindgen_padding_24: u32,
    pub EncryptionLevel: UINT32,
    pub ServerRandom: *mut BYTE,
    pub ServerRandomLength: UINT32,
    pub ServerCertificate: *mut BYTE,
    pub ServerCertificateLength: UINT32,
    pub ClientRandom: *mut BYTE,
    pub ClientRandomLength: UINT32,
    pub padding0256: [UINT64; 54usize],
    pub ChannelCount: UINT32,
    pub __bindgen_padding_25: u32,
    pub ChannelDefArraySize: UINT32,
    pub ChannelDefArray: *mut CHANNEL_DEF,
    pub padding0320: [UINT64; 61usize],
    pub ClusterInfoFlags: UINT32,
    pub __bindgen_padding_26: u32,
    pub RedirectedSessionId: UINT32,
    pub __bindgen_padding_27: u32,
    pub ConsoleSession: BOOL,
    pub padding0384: [UINT64; 61usize],
    pub MonitorCount: UINT32,
    pub __bindgen_padding_28: u32,
    pub MonitorDefArraySize: UINT32,
    pub MonitorDefArray: *mut rdpMonitor,
    pub SpanMonitors: BOOL,
    pub __bindgen_padding_29: u32,
    pub UseMultimon: BOOL,
    pub __bindgen_padding_30: u32,
    pub ForceMultimon: BOOL,
    pub __bindgen_padding_31: u32,
    pub DesktopPosX: UINT32,
    pub __bindgen_padding_32: u32,
    pub DesktopPosY: UINT32,
    pub __bindgen_padding_33: u32,
    pub ListMonitors: BOOL,
    pub MonitorIds: *mut UINT32,
    pub NumMonitorIds: UINT32,
    pub __bindgen_padding_34: u32,
    pub MonitorLocalShiftX: UINT32,
    pub __bindgen_padding_35: u32,
    pub MonitorLocalShiftY: UINT32,
    pub __bindgen_padding_36: u32,
    pub HasMonitorAttributes: BOOL,
    pub padding0448: [UINT64; 50usize],
    pub padding0512: [UINT64; 64usize],
    pub MultitransportFlags: UINT32,
    pub __bindgen_padding_37: u32,
    pub SupportMultitransport: BOOL,
    pub padding0576: [UINT64; 62usize],
    pub padding0640: [UINT64; 64usize],
    pub AlternateShell: *mut ::std::os::raw::c_char,
    pub ShellWorkingDirectory: *mut ::std::os::raw::c_char,
    pub padding0704: [UINT64; 62usize],
    pub AutoLogonEnabled: BOOL,
    pub __bindgen_padding_38: u32,
    pub CompressionEnabled: BOOL,
    pub __bindgen_padding_39: u32,
    pub DisableCtrlAltDel: BOOL,
    pub __bindgen_padding_40: u32,
    pub EnableWindowsKey: BOOL,
    pub __bindgen_padding_41: u32,
    pub MaximizeShell: BOOL,
    pub __bindgen_padding_42: u32,
    pub LogonNotify: BOOL,
    pub __bindgen_padding_43: u32,
    pub LogonErrors: BOOL,
    pub __bindgen_padding_44: u32,
    pub MouseAttached: BOOL,
    pub __bindgen_padding_45: u32,
    pub MouseHasWheel: BOOL,
    pub __bindgen_padding_46: u32,
    pub RemoteConsoleAudio: BOOL,
    pub __bindgen_padding_47: u32,
    pub AudioPlayback: BOOL,
    pub __bindgen_padding_48: u32,
    pub AudioCapture: BOOL,
    pub __bindgen_padding_49: u32,
    pub VideoDisable: BOOL,
    pub __bindgen_padding_50: u32,
    pub PasswordIsSmartcardPin: BOOL,
    pub __bindgen_padding_51: u32,
    pub UsingSavedCredentials: BOOL,
    pub __bindgen_padding_52: u32,
    pub ForceEncryptedCsPdu: BOOL,
    pub __bindgen_padding_53: u32,
    pub HiDefRemoteApp: BOOL,
    pub __bindgen_padding_54: u32,
    pub CompressionLevel: UINT32,
    pub padding0768: [UINT64; 46usize],
    pub IPv6Enabled: BOOL,
    pub ClientAddress: *mut ::std::os::raw::c_char,
    pub ClientDir: *mut ::std::os::raw::c_char,
    pub padding0832: [UINT64; 61usize],
    pub AutoReconnectionEnabled: BOOL,
    pub __bindgen_padding_55: u32,
    pub AutoReconnectMaxRetries: UINT32,
    pub ClientAutoReconnectCookie: *mut ARC_CS_PRIVATE_PACKET,
    pub ServerAutoReconnectCookie: *mut ARC_SC_PRIVATE_PACKET,
    pub PrintReconnectCookie: BOOL,
    pub padding0896: [UINT64; 59usize],
    pub ClientTimeZone: *mut TIME_ZONE_INFORMATION,
    pub DynamicDSTTimeZoneKeyName: *mut ::std::os::raw::c_char,
    pub DynamicDaylightTimeDisabled: BOOL,
    pub padding0960: [UINT64; 61usize],
    pub PerformanceFlags: UINT32,
    pub __bindgen_padding_56: u32,
    pub AllowFontSmoothing: BOOL,
    pub __bindgen_padding_57: u32,
    pub DisableWallpaper: BOOL,
    pub __bindgen_padding_58: u32,
    pub DisableFullWindowDrag: BOOL,
    pub __bindgen_padding_59: u32,
    pub DisableMenuAnims: BOOL,
    pub __bindgen_padding_60: u32,
    pub DisableThemes: BOOL,
    pub __bindgen_padding_61: u32,
    pub DisableCursorShadow: BOOL,
    pub __bindgen_padding_62: u32,
    pub DisableCursorBlinking: BOOL,
    pub __bindgen_padding_63: u32,
    pub AllowDesktopComposition: BOOL,
    pub padding1024: [UINT64; 55usize],
    pub RemoteAssistanceMode: BOOL,
    pub RemoteAssistanceSessionId: *mut ::std::os::raw::c_char,
    pub RemoteAssistancePassStub: *mut ::std::os::raw::c_char,
    pub RemoteAssistancePassword: *mut ::std::os::raw::c_char,
    pub RemoteAssistanceRCTicket: *mut ::std::os::raw::c_char,
    pub EncomspVirtualChannel: BOOL,
    pub __bindgen_padding_64: u32,
    pub RemdeskVirtualChannel: BOOL,
    pub __bindgen_padding_65: u32,
    pub LyncRdpMode: BOOL,
    pub __bindgen_padding_66: u32,
    pub RemoteAssistanceRequestControl: BOOL,
    pub padding1088: [UINT64; 55usize],
    #[doc = " X.224 Connection Request/Confirm"]
    pub TlsSecurity: BOOL,
    pub __bindgen_padding_67: u32,
    pub NlaSecurity: BOOL,
    pub __bindgen_padding_68: u32,
    pub RdpSecurity: BOOL,
    pub __bindgen_padding_69: u32,
    pub ExtSecurity: BOOL,
    pub __bindgen_padding_70: u32,
    pub Authentication: BOOL,
    pub __bindgen_padding_71: u32,
    pub RequestedProtocols: UINT32,
    pub __bindgen_padding_72: u32,
    pub SelectedProtocol: UINT32,
    pub __bindgen_padding_73: u32,
    pub NegotiationFlags: UINT32,
    pub __bindgen_padding_74: u32,
    pub NegotiateSecurityLayer: BOOL,
    pub __bindgen_padding_75: u32,
    pub RestrictedAdminModeRequired: BOOL,
    pub AuthenticationServiceClass: *mut ::std::os::raw::c_char,
    pub DisableCredentialsDelegation: BOOL,
    pub __bindgen_padding_76: u32,
    pub AuthenticationLevel: UINT32,
    pub AllowedTlsCiphers: *mut ::std::os::raw::c_char,
    pub VmConnectMode: BOOL,
    pub NtlmSamFile: *mut ::std::os::raw::c_char,
    pub FIPSMode: BOOL,
    pub __bindgen_padding_77: u32,
    pub TlsSecLevel: UINT32,
    pub padding1152: [UINT64; 46usize],
    pub MstscCookieMode: BOOL,
    pub __bindgen_padding_78: u32,
    pub CookieMaxLength: UINT32,
    pub __bindgen_padding_79: u32,
    pub PreconnectionId: UINT32,
    pub PreconnectionBlob: *mut ::std::os::raw::c_char,
    pub SendPreconnectionPdu: BOOL,
    pub padding1216: [UINT64; 59usize],
    pub RedirectionFlags: UINT32,
    pub TargetNetAddress: *mut ::std::os::raw::c_char,
    pub LoadBalanceInfo: *mut BYTE,
    pub LoadBalanceInfoLength: UINT32,
    pub RedirectionUsername: *mut ::std::os::raw::c_char,
    pub RedirectionDomain: *mut ::std::os::raw::c_char,
    pub RedirectionPassword: *mut BYTE,
    pub RedirectionPasswordLength: UINT32,
    pub RedirectionTargetFQDN: *mut ::std::os::raw::c_char,
    pub RedirectionTargetNetBiosName: *mut ::std::os::raw::c_char,
    pub RedirectionTsvUrl: *mut BYTE,
    pub RedirectionTsvUrlLength: UINT32,
    pub __bindgen_padding_80: u32,
    pub TargetNetAddressCount: UINT32,
    pub TargetNetAddresses: *mut *mut ::std::os::raw::c_char,
    pub TargetNetPorts: *mut UINT32,
    pub RedirectionAcceptedCert: *mut ::std::os::raw::c_char,
    pub RedirectionAcceptedCertLength: UINT32,
    pub __bindgen_padding_81: u32,
    pub RedirectionPreferType: UINT32,
    pub padding1280: [UINT64; 46usize],
    #[doc = " Security"]
    pub Password51: *mut BYTE,
    pub Password51Length: UINT32,
    pub __bindgen_padding_82: u32,
    pub SmartcardLogon: BOOL,
    pub __bindgen_padding_83: u32,
    pub PromptForCredentials: BOOL,
    pub padding1344: [UINT64; 60usize],
    pub KerberosKdc: *mut ::std::os::raw::c_char,
    pub KerberosRealm: *mut ::std::os::raw::c_char,
    pub padding1408: [UINT64; 62usize],
    pub IgnoreCertificate: BOOL,
    pub CertificateName: *mut ::std::os::raw::c_char,
    pub CertificateFile: *mut ::std::os::raw::c_char,
    pub PrivateKeyFile: *mut ::std::os::raw::c_char,
    pub RdpKeyFile: *mut ::std::os::raw::c_char,
    pub RdpServerRsaKey: *mut rdpRsaKey,
    pub RdpServerCertificate: *mut rdpCertificate,
    pub ExternalCertificateManagement: BOOL,
    pub CertificateContent: *mut ::std::os::raw::c_char,
    pub PrivateKeyContent: *mut ::std::os::raw::c_char,
    pub RdpKeyContent: *mut ::std::os::raw::c_char,
    pub AutoAcceptCertificate: BOOL,
    pub __bindgen_padding_84: u32,
    pub AutoDenyCertificate: BOOL,
    pub CertificateAcceptedFingerprints: *mut ::std::os::raw::c_char,
    pub padding1472: [UINT64; 50usize],
    pub padding1536: [UINT64; 64usize],
    #[doc = " User Interface"]
    pub Workarea: BOOL,
    pub __bindgen_padding_85: u32,
    pub Fullscreen: BOOL,
    pub __bindgen_padding_86: u32,
    pub PercentScreen: UINT32,
    pub __bindgen_padding_87: u32,
    pub GrabKeyboard: BOOL,
    pub __bindgen_padding_88: u32,
    pub Decorations: BOOL,
    pub __bindgen_padding_89: u32,
    pub MouseMotion: BOOL,
    pub WindowTitle: *mut ::std::os::raw::c_char,
    pub ParentWindowId: UINT64,
    pub AsyncInput: BOOL,
    pub __bindgen_padding_90: u32,
    pub AsyncUpdate: BOOL,
    pub __bindgen_padding_91: u32,
    pub AsyncChannels: BOOL,
    pub padding1548: [UINT64; 1usize],
    pub ToggleFullscreen: BOOL,
    pub WmClass: *mut ::std::os::raw::c_char,
    pub EmbeddedWindow: BOOL,
    pub __bindgen_padding_92: u32,
    pub SmartSizing: BOOL,
    pub __bindgen_padding_93: u32,
    pub XPan: INT32,
    pub __bindgen_padding_94: u32,
    pub YPan: INT32,
    pub __bindgen_padding_95: u32,
    pub SmartSizingWidth: UINT32,
    pub __bindgen_padding_96: u32,
    pub SmartSizingHeight: UINT32,
    pub __bindgen_padding_97: u32,
    pub PercentScreenUseWidth: BOOL,
    pub __bindgen_padding_98: u32,
    pub PercentScreenUseHeight: BOOL,
    pub __bindgen_padding_99: u32,
    pub DynamicResolutionUpdate: BOOL,
    pub padding1601: [UINT64; 42usize],
    pub SoftwareGdi: BOOL,
    pub __bindgen_padding_100: u32,
    pub LocalConnection: BOOL,
    pub __bindgen_padding_101: u32,
    pub AuthenticationOnly: BOOL,
    pub __bindgen_padding_102: u32,
    pub CredentialsFromStdin: BOOL,
    pub __bindgen_padding_103: u32,
    pub UnmapButtons: BOOL,
    pub __bindgen_padding_104: u32,
    pub OldLicenseBehaviour: BOOL,
    pub padding1664: [UINT64; 57usize],
    pub ComputerName: *mut ::std::os::raw::c_char,
    pub padding1728: [UINT64; 63usize],
    pub ConnectionFile: *mut ::std::os::raw::c_char,
    pub AssistanceFile: *mut ::std::os::raw::c_char,
    pub padding1792: [UINT64; 62usize],
    pub HomePath: *mut ::std::os::raw::c_char,
    pub ConfigPath: *mut ::std::os::raw::c_char,
    pub CurrentPath: *mut ::std::os::raw::c_char,
    pub padding1856: [UINT64; 61usize],
    pub DumpRemoteFx: BOOL,
    pub __bindgen_padding_105: u32,
    pub PlayRemoteFx: BOOL,
    pub DumpRemoteFxFile: *mut ::std::os::raw::c_char,
    pub PlayRemoteFxFile: *mut ::std::os::raw::c_char,
    pub padding1920: [UINT64; 60usize],
    pub padding1984: [UINT64; 64usize],
    #[doc = " Gateway"]
    pub GatewayUsageMethod: UINT32,
    pub __bindgen_padding_106: u32,
    pub GatewayPort: UINT32,
    pub GatewayHostname: *mut ::std::os::raw::c_char,
    pub GatewayUsername: *mut ::std::os::raw::c_char,
    pub GatewayPassword: *mut ::std::os::raw::c_char,
    pub GatewayDomain: *mut ::std::os::raw::c_char,
    pub GatewayCredentialsSource: UINT32,
    pub __bindgen_padding_107: u32,
    pub GatewayUseSameCredentials: BOOL,
    pub __bindgen_padding_108: u32,
    pub GatewayEnabled: BOOL,
    pub __bindgen_padding_109: u32,
    pub GatewayBypassLocal: BOOL,
    pub __bindgen_padding_110: u32,
    pub GatewayRpcTransport: BOOL,
    pub __bindgen_padding_111: u32,
    pub GatewayHttpTransport: BOOL,
    pub __bindgen_padding_112: u32,
    pub GatewayUdpTransport: BOOL,
    pub GatewayAccessToken: *mut ::std::os::raw::c_char,
    pub GatewayAcceptedCert: *mut ::std::os::raw::c_char,
    pub GatewayAcceptedCertLength: UINT32,
    pub __bindgen_padding_113: u32,
    pub GatewayHttpUseWebsockets: BOOL,
    pub padding2015: [UINT64; 14usize],
    pub ProxyType: UINT32,
    pub ProxyHostname: *mut ::std::os::raw::c_char,
    pub ProxyPort: UINT16,
    pub ProxyUsername: *mut ::std::os::raw::c_char,
    pub ProxyPassword: *mut ::std::os::raw::c_char,
    pub padding2112: [UINT64; 92usize],
    #[doc = " RemoteApp"]
    pub RemoteApplicationMode: BOOL,
    pub RemoteApplicationName: *mut ::std::os::raw::c_char,
    pub RemoteApplicationIcon: *mut ::std::os::raw::c_char,
    pub RemoteApplicationProgram: *mut ::std::os::raw::c_char,
    pub RemoteApplicationFile: *mut ::std::os::raw::c_char,
    pub RemoteApplicationGuid: *mut ::std::os::raw::c_char,
    pub RemoteApplicationCmdLine: *mut ::std::os::raw::c_char,
    pub RemoteApplicationExpandCmdLine: UINT32,
    pub __bindgen_padding_114: u32,
    pub RemoteApplicationExpandWorkingDir: UINT32,
    pub __bindgen_padding_115: u32,
    pub DisableRemoteAppCapsCheck: BOOL,
    pub __bindgen_padding_116: u32,
    pub RemoteAppNumIconCaches: UINT32,
    pub __bindgen_padding_117: u32,
    pub RemoteAppNumIconCacheEntries: UINT32,
    pub __bindgen_padding_118: u32,
    pub RemoteAppLanguageBarSupported: BOOL,
    pub __bindgen_padding_119: u32,
    pub RemoteWndSupportLevel: UINT32,
    pub __bindgen_padding_120: u32,
    pub RemoteApplicationSupportLevel: UINT32,
    pub __bindgen_padding_121: u32,
    pub RemoteApplicationSupportMask: UINT32,
    pub RemoteApplicationWorkingDir: *mut ::std::os::raw::c_char,
    pub padding2176: [UINT64; 47usize],
    pub padding2240: [UINT64; 64usize],
    #[doc = " Mandatory Capabilities"]
    pub ReceivedCapabilities: *mut BYTE,
    pub ReceivedCapabilitiesSize: UINT32,
    pub padding2304: [UINT64; 62usize],
    pub OsMajorType: UINT32,
    pub __bindgen_padding_122: u32,
    pub OsMinorType: UINT32,
    pub __bindgen_padding_123: u32,
    pub RefreshRect: BOOL,
    pub __bindgen_padding_124: u32,
    pub SuppressOutput: BOOL,
    pub __bindgen_padding_125: u32,
    pub FastPathOutput: BOOL,
    pub __bindgen_padding_126: u32,
    pub SaltedChecksum: BOOL,
    pub __bindgen_padding_127: u32,
    pub LongCredentialsSupported: BOOL,
    pub __bindgen_padding_128: u32,
    pub NoBitmapCompressionHeader: BOOL,
    pub __bindgen_padding_129: u32,
    pub BitmapCompressionDisabled: BOOL,
    pub padding2368: [UINT64; 55usize],
    pub DesktopResize: BOOL,
    pub __bindgen_padding_130: u32,
    pub DrawAllowDynamicColorFidelity: BOOL,
    pub __bindgen_padding_131: u32,
    pub DrawAllowColorSubsampling: BOOL,
    pub __bindgen_padding_132: u32,
    pub DrawAllowSkipAlpha: BOOL,
    pub padding2432: [UINT64; 60usize],
    pub OrderSupport: *mut BYTE,
    pub BitmapCacheV3Enabled: BOOL,
    pub __bindgen_padding_133: u32,
    pub AltSecFrameMarkerSupport: BOOL,
    pub __bindgen_padding_134: u32,
    pub AllowUnanouncedOrdersFromServer: BOOL,
    pub padding2497: [UINT64; 61usize],
    pub BitmapCacheEnabled: BOOL,
    pub __bindgen_padding_135: u32,
    pub BitmapCacheVersion: UINT32,
    pub __bindgen_padding_136: u32,
    pub AllowCacheWaitingList: BOOL,
    pub __bindgen_padding_137: u32,
    pub BitmapCachePersistEnabled: BOOL,
    pub __bindgen_padding_138: u32,
    pub BitmapCacheV2NumCells: UINT32,
    pub BitmapCacheV2CellInfo: *mut BITMAP_CACHE_V2_CELL_INFO,
    pub padding2560: [UINT64; 57usize],
    pub ColorPointerFlag: BOOL,
    pub __bindgen_padding_139: u32,
    pub PointerCacheSize: UINT32,
    pub padding2624: [UINT64; 60usize],
    pub KeyboardRemappingList: *mut ::std::os::raw::c_char,
    pub KeyboardCodePage: UINT32,
    pub __bindgen_padding_140: u32,
    pub KeyboardLayout: UINT32,
    pub __bindgen_padding_141: u32,
    pub KeyboardType: UINT32,
    pub __bindgen_padding_142: u32,
    pub KeyboardSubType: UINT32,
    pub __bindgen_padding_143: u32,
    pub KeyboardFunctionKey: UINT32,
    pub ImeFileName: *mut ::std::os::raw::c_char,
    pub UnicodeInput: BOOL,
    pub __bindgen_padding_144: u32,
    pub FastPathInput: BOOL,
    pub __bindgen_padding_145: u32,
    pub MultiTouchInput: BOOL,
    pub __bindgen_padding_146: u32,
    pub MultiTouchGestures: BOOL,
    pub __bindgen_padding_147: u32,
    pub KeyboardHook: UINT32,
    pub __bindgen_padding_148: u32,
    pub HasHorizontalWheel: BOOL,
    pub __bindgen_padding_149: u32,
    pub HasExtendedMouseEvent: BOOL,
    pub padding2688: [UINT64; 52usize],
    pub BrushSupportLevel: UINT32,
    pub padding2752: [UINT64; 63usize],
    pub GlyphSupportLevel: UINT32,
    pub GlyphCache: *mut GLYPH_CACHE_DEFINITION,
    pub FragCache: *mut GLYPH_CACHE_DEFINITION,
    pub padding2816: [UINT64; 61usize],
    pub OffscreenSupportLevel: UINT32,
    pub __bindgen_padding_150: u32,
    pub OffscreenCacheSize: UINT32,
    pub __bindgen_padding_151: u32,
    pub OffscreenCacheEntries: UINT32,
    pub padding2880: [UINT64; 61usize],
    pub VirtualChannelCompressionFlags: UINT32,
    pub __bindgen_padding_152: u32,
    pub VirtualChannelChunkSize: UINT32,
    pub padding2944: [UINT64; 62usize],
    pub SoundBeepsEnabled: BOOL,
    pub padding3008: [UINT64; 63usize],
    pub padding3072: [UINT64; 64usize],
    #[doc = " Optional Capabilities"]
    pub padding3136: [UINT64; 64usize],
    pub padding3200: [UINT64; 64usize],
    pub padding3264: [UINT64; 64usize],
    pub padding3328: [UINT64; 64usize],
    pub MultifragMaxRequestSize: UINT32,
    pub padding3392: [UINT64; 63usize],
    pub LargePointerFlag: UINT32,
    pub padding3456: [UINT64; 63usize],
    pub CompDeskSupportLevel: UINT32,
    pub padding3520: [UINT64; 63usize],
    pub SurfaceCommandsEnabled: BOOL,
    pub __bindgen_padding_153: u32,
    pub FrameMarkerCommandEnabled: BOOL,
    pub __bindgen_padding_154: u32,
    pub SurfaceFrameMarkerEnabled: BOOL,
    pub padding3584: [UINT64; 61usize],
    pub padding3648: [UINT64; 64usize],
    pub RemoteFxOnly: BOOL,
    pub __bindgen_padding_155: u32,
    pub RemoteFxCodec: BOOL,
    pub __bindgen_padding_156: u32,
    pub RemoteFxCodecId: UINT32,
    pub __bindgen_padding_157: u32,
    pub RemoteFxCodecMode: UINT32,
    pub __bindgen_padding_158: u32,
    pub RemoteFxImageCodec: BOOL,
    pub __bindgen_padding_159: u32,
    pub RemoteFxCaptureFlags: UINT32,
    pub padding3712: [UINT64; 58usize],
    pub NSCodec: BOOL,
    pub __bindgen_padding_160: u32,
    pub NSCodecId: UINT32,
    pub __bindgen_padding_161: u32,
    pub FrameAcknowledge: UINT32,
    pub __bindgen_padding_162: u32,
    pub NSCodecColorLossLevel: UINT32,
    pub __bindgen_padding_163: u32,
    pub NSCodecAllowSubsampling: BOOL,
    pub __bindgen_padding_164: u32,
    pub NSCodecAllowDynamicColorFidelity: BOOL,
    pub padding3776: [UINT64; 58usize],
    pub JpegCodec: BOOL,
    pub __bindgen_padding_165: u32,
    pub JpegCodecId: UINT32,
    pub __bindgen_padding_166: u32,
    pub JpegQuality: UINT32,
    pub padding3840: [UINT64; 61usize],
    pub GfxThinClient: BOOL,
    pub __bindgen_padding_167: u32,
    pub GfxSmallCache: BOOL,
    pub __bindgen_padding_168: u32,
    pub GfxProgressive: BOOL,
    pub __bindgen_padding_169: u32,
    pub GfxProgressiveV2: BOOL,
    pub __bindgen_padding_170: u32,
    pub GfxH264: BOOL,
    pub __bindgen_padding_171: u32,
    pub GfxAVC444: BOOL,
    pub __bindgen_padding_172: u32,
    pub GfxSendQoeAck: BOOL,
    pub __bindgen_padding_173: u32,
    pub GfxAVC444v2: BOOL,
    pub __bindgen_padding_174: u32,
    pub GfxCapsFilter: UINT32,
    pub padding3904: [UINT64; 55usize],
    #[doc = " Caches"]
    pub BitmapCacheV3CodecId: UINT32,
    pub padding3968: [UINT64; 63usize],
    pub DrawNineGridEnabled: BOOL,
    pub __bindgen_padding_175: u32,
    pub DrawNineGridCacheSize: UINT32,
    pub __bindgen_padding_176: u32,
    pub DrawNineGridCacheEntries: UINT32,
    pub padding4032: [UINT64; 61usize],
    pub DrawGdiPlusEnabled: BOOL,
    pub __bindgen_padding_177: u32,
    pub DrawGdiPlusCacheEnabled: BOOL,
    pub padding4096: [UINT64; 62usize],
    pub padding4160: [UINT64; 64usize],
    #[doc = " Device Redirection"]
    pub DeviceRedirection: BOOL,
    pub __bindgen_padding_178: u32,
    pub DeviceCount: UINT32,
    pub __bindgen_padding_179: u32,
    pub DeviceArraySize: UINT32,
    pub DeviceArray: *mut *mut RDPDR_DEVICE,
    pub padding4288: [UINT64; 124usize],
    pub RedirectDrives: BOOL,
    pub __bindgen_padding_180: u32,
    pub RedirectHomeDrive: BOOL,
    pub DrivesToRedirect: *mut ::std::os::raw::c_char,
    pub padding4416: [UINT64; 125usize],
    pub RedirectSmartCards: BOOL,
    pub padding4544: [UINT64; 127usize],
    pub RedirectPrinters: BOOL,
    pub padding4672: [UINT64; 127usize],
    pub RedirectSerialPorts: BOOL,
    pub __bindgen_padding_181: u32,
    pub RedirectParallelPorts: BOOL,
    pub __bindgen_padding_182: u32,
    pub PreferIPv6OverIPv4: BOOL,
    pub padding4800: [UINT64; 125usize],
    #[doc = " Other Redirection"]
    pub RedirectClipboard: BOOL,
    pub padding4928: [UINT64; 127usize],
    #[doc = " Static Virtual Channels"]
    pub StaticChannelCount: UINT32,
    pub __bindgen_padding_183: u32,
    pub StaticChannelArraySize: UINT32,
    pub StaticChannelArray: *mut *mut ADDIN_ARGV,
    pub padding5056: [UINT64; 125usize],
    #[doc = " Dynamic Virtual Channels"]
    pub DynamicChannelCount: UINT32,
    pub __bindgen_padding_184: u32,
    pub DynamicChannelArraySize: UINT32,
    pub DynamicChannelArray: *mut *mut ADDIN_ARGV,
    pub SupportDynamicChannels: BOOL,
    pub padding5184: [UINT64; 124usize],
    pub SupportEchoChannel: BOOL,
    pub __bindgen_padding_185: u32,
    pub SupportDisplayControl: BOOL,
    pub __bindgen_padding_186: u32,
    pub SupportGeometryTracking: BOOL,
    pub __bindgen_padding_187: u32,
    pub SupportSSHAgentChannel: BOOL,
    pub __bindgen_padding_188: u32,
    pub SupportVideoOptimized: BOOL,
    pub RDP2TCPArgs: *mut ::std::os::raw::c_char,
    pub TcpKeepAlive: BOOL,
    pub __bindgen_padding_189: u32,
    pub TcpKeepAliveRetries: UINT32,
    pub __bindgen_padding_190: u32,
    pub TcpKeepAliveDelay: UINT32,
    pub __bindgen_padding_191: u32,
    pub TcpKeepAliveInterval: UINT32,
    pub __bindgen_padding_192: u32,
    pub TcpAckTimeout: UINT32,
    pub padding5312: [UINT64; 117usize],
    #[doc = " WARNING: End of ABI stable zone!"]
    #[doc = ""]
    #[doc = " The zone below this point is ABI unstable, and"]
    #[doc = " is therefore potentially subject to ABI breakage."]
    pub num_extensions: INT32,
    pub extensions: [rdp_ext_set; 16usize],
    pub SettingsModified: *mut BYTE,
    pub ActionScript: *mut ::std::os::raw::c_char,
    pub Floatbar: DWORD,
    pub XSelectionAtom: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_rdp_settings() {
    assert_eq!(
        ::std::mem::size_of::<rdp_settings>(),
        46760usize,
        concat!("Size of: ", stringify!(rdp_settings))
    );
    assert_eq!(
        ::std::mem::align_of::<rdp_settings>(),
        8usize,
        concat!("Alignment of ", stringify!(rdp_settings))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).instance as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(instance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding001 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding001)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ServerMode as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ShareId as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ShareId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PduSource as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PduSource)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ServerPort as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerPort)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ServerHostname as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerHostname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Username as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Username)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Password as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Domain as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PasswordHash as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PasswordHash)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).WaitForOutputBufferFlush as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(WaitForOutputBufferFlush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MaxTimeInCheckLoop as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MaxTimeInCheckLoop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AcceptedCert as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AcceptedCert)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AcceptedCertLength as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AcceptedCertLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0064 as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0064)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0128 as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0128)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RdpVersion as *const _ as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RdpVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopWidth as *const _ as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopHeight as *const _ as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ColorDepth as *const _ as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ColorDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ConnectionType as *const _ as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ConnectionType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientBuild as *const _ as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientBuild)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientHostname as *const _ as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientHostname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientProductId as *const _ as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientProductId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).EarlyCapabilityFlags as *const _ as usize
        },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(EarlyCapabilityFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).NetworkAutoDetect as *const _ as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NetworkAutoDetect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportAsymetricKeys as *const _ as usize
        },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportAsymetricKeys)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportErrorInfoPdu as *const _ as usize
        },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportErrorInfoPdu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportStatusInfoPdu as *const _ as usize
        },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportStatusInfoPdu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportMonitorLayoutPdu as *const _ as usize
        },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportMonitorLayoutPdu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportGraphicsPipeline as *const _ as usize
        },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportGraphicsPipeline)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportDynamicTimeZone as *const _ as usize
        },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportDynamicTimeZone)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportHeartbeatPdu as *const _ as usize
        },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportHeartbeatPdu)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DesktopPhysicalWidth as *const _ as usize
        },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopPhysicalWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DesktopPhysicalHeight as *const _ as usize
        },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopPhysicalHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopOrientation as *const _ as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopOrientation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopScaleFactor as *const _ as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopScaleFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DeviceScaleFactor as *const _ as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DeviceScaleFactor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0192 as *const _ as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0192)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).UseRdpSecurityLayer as *const _ as usize
        },
        1536usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(UseRdpSecurityLayer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).EncryptionMethods as *const _ as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(EncryptionMethods)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ExtEncryptionMethods as *const _ as usize
        },
        1552usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ExtEncryptionMethods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).EncryptionLevel as *const _ as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(EncryptionLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ServerRandom as *const _ as usize },
        1568usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerRandom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ServerRandomLength as *const _ as usize },
        1576usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerRandomLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ServerCertificate as *const _ as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerCertificate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ServerCertificateLength as *const _ as usize
        },
        1592usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerCertificateLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientRandom as *const _ as usize },
        1600usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientRandom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientRandomLength as *const _ as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientRandomLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0256 as *const _ as usize },
        1616usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0256)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ChannelCount as *const _ as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ChannelCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ChannelDefArraySize as *const _ as usize
        },
        2056usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ChannelDefArraySize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ChannelDefArray as *const _ as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ChannelDefArray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0320 as *const _ as usize },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0320)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClusterInfoFlags as *const _ as usize },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClusterInfoFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectedSessionId as *const _ as usize
        },
        2568usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectedSessionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ConsoleSession as *const _ as usize },
        2576usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ConsoleSession)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0384 as *const _ as usize },
        2584usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0384)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MonitorCount as *const _ as usize },
        3072usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MonitorCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).MonitorDefArraySize as *const _ as usize
        },
        3080usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MonitorDefArraySize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MonitorDefArray as *const _ as usize },
        3088usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MonitorDefArray)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SpanMonitors as *const _ as usize },
        3096usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SpanMonitors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).UseMultimon as *const _ as usize },
        3104usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(UseMultimon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ForceMultimon as *const _ as usize },
        3112usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ForceMultimon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopPosX as *const _ as usize },
        3120usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopPosX)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopPosY as *const _ as usize },
        3128usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopPosY)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ListMonitors as *const _ as usize },
        3136usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ListMonitors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MonitorIds as *const _ as usize },
        3144usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MonitorIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).NumMonitorIds as *const _ as usize },
        3152usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NumMonitorIds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MonitorLocalShiftX as *const _ as usize },
        3160usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MonitorLocalShiftX)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MonitorLocalShiftY as *const _ as usize },
        3168usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MonitorLocalShiftY)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).HasMonitorAttributes as *const _ as usize
        },
        3176usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(HasMonitorAttributes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0448 as *const _ as usize },
        3184usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0448)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0512 as *const _ as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0512)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).MultitransportFlags as *const _ as usize
        },
        4096usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MultitransportFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SupportMultitransport as *const _ as usize
        },
        4104usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SupportMultitransport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0576 as *const _ as usize },
        4112usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0576)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0640 as *const _ as usize },
        4608usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0640)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AlternateShell as *const _ as usize },
        5120usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AlternateShell)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ShellWorkingDirectory as *const _ as usize
        },
        5128usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ShellWorkingDirectory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0704 as *const _ as usize },
        5136usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0704)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AutoLogonEnabled as *const _ as usize },
        5632usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AutoLogonEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CompressionEnabled as *const _ as usize },
        5640usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CompressionEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DisableCtrlAltDel as *const _ as usize },
        5648usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableCtrlAltDel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).EnableWindowsKey as *const _ as usize },
        5656usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(EnableWindowsKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MaximizeShell as *const _ as usize },
        5664usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MaximizeShell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).LogonNotify as *const _ as usize },
        5672usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LogonNotify)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).LogonErrors as *const _ as usize },
        5680usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LogonErrors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MouseAttached as *const _ as usize },
        5688usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MouseAttached)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MouseHasWheel as *const _ as usize },
        5696usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MouseHasWheel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RemoteConsoleAudio as *const _ as usize },
        5704usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteConsoleAudio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AudioPlayback as *const _ as usize },
        5712usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AudioPlayback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AudioCapture as *const _ as usize },
        5720usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AudioCapture)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).VideoDisable as *const _ as usize },
        5728usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(VideoDisable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).PasswordIsSmartcardPin as *const _ as usize
        },
        5736usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PasswordIsSmartcardPin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).UsingSavedCredentials as *const _ as usize
        },
        5744usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(UsingSavedCredentials)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ForceEncryptedCsPdu as *const _ as usize
        },
        5752usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ForceEncryptedCsPdu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).HiDefRemoteApp as *const _ as usize },
        5760usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(HiDefRemoteApp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CompressionLevel as *const _ as usize },
        5768usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CompressionLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0768 as *const _ as usize },
        5776usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0768)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).IPv6Enabled as *const _ as usize },
        6144usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(IPv6Enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientAddress as *const _ as usize },
        6152usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientDir as *const _ as usize },
        6160usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientDir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0832 as *const _ as usize },
        6168usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0832)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AutoReconnectionEnabled as *const _ as usize
        },
        6656usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AutoReconnectionEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AutoReconnectMaxRetries as *const _ as usize
        },
        6664usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AutoReconnectMaxRetries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ClientAutoReconnectCookie as *const _ as usize
        },
        6672usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientAutoReconnectCookie)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ServerAutoReconnectCookie as *const _ as usize
        },
        6680usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ServerAutoReconnectCookie)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).PrintReconnectCookie as *const _ as usize
        },
        6688usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PrintReconnectCookie)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0896 as *const _ as usize },
        6696usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0896)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ClientTimeZone as *const _ as usize },
        7168usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ClientTimeZone)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DynamicDSTTimeZoneKeyName as *const _ as usize
        },
        7176usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DynamicDSTTimeZoneKeyName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DynamicDaylightTimeDisabled as *const _
                as usize
        },
        7184usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DynamicDaylightTimeDisabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding0960 as *const _ as usize },
        7192usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding0960)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PerformanceFlags as *const _ as usize },
        7680usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PerformanceFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AllowFontSmoothing as *const _ as usize },
        7688usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AllowFontSmoothing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DisableWallpaper as *const _ as usize },
        7696usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableWallpaper)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DisableFullWindowDrag as *const _ as usize
        },
        7704usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableFullWindowDrag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DisableMenuAnims as *const _ as usize },
        7712usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableMenuAnims)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DisableThemes as *const _ as usize },
        7720usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableThemes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DisableCursorShadow as *const _ as usize
        },
        7728usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableCursorShadow)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DisableCursorBlinking as *const _ as usize
        },
        7736usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableCursorBlinking)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AllowDesktopComposition as *const _ as usize
        },
        7744usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AllowDesktopComposition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1024 as *const _ as usize },
        7752usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1024)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAssistanceMode as *const _ as usize
        },
        8192usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAssistanceMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAssistanceSessionId as *const _ as usize
        },
        8200usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAssistanceSessionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAssistancePassStub as *const _ as usize
        },
        8208usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAssistancePassStub)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAssistancePassword as *const _ as usize
        },
        8216usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAssistancePassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAssistanceRCTicket as *const _ as usize
        },
        8224usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAssistanceRCTicket)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).EncomspVirtualChannel as *const _ as usize
        },
        8232usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(EncomspVirtualChannel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemdeskVirtualChannel as *const _ as usize
        },
        8240usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemdeskVirtualChannel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).LyncRdpMode as *const _ as usize },
        8248usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LyncRdpMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAssistanceRequestControl as *const _
                as usize
        },
        8256usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAssistanceRequestControl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1088 as *const _ as usize },
        8264usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1088)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).TlsSecurity as *const _ as usize },
        8704usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(TlsSecurity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).NlaSecurity as *const _ as usize },
        8712usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NlaSecurity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RdpSecurity as *const _ as usize },
        8720usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RdpSecurity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ExtSecurity as *const _ as usize },
        8728usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ExtSecurity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Authentication as *const _ as usize },
        8736usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Authentication)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RequestedProtocols as *const _ as usize },
        8744usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RequestedProtocols)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SelectedProtocol as *const _ as usize },
        8752usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SelectedProtocol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).NegotiationFlags as *const _ as usize },
        8760usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NegotiationFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).NegotiateSecurityLayer as *const _ as usize
        },
        8768usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NegotiateSecurityLayer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RestrictedAdminModeRequired as *const _
                as usize
        },
        8776usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RestrictedAdminModeRequired)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AuthenticationServiceClass as *const _ as usize
        },
        8784usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AuthenticationServiceClass)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DisableCredentialsDelegation as *const _
                as usize
        },
        8792usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableCredentialsDelegation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AuthenticationLevel as *const _ as usize
        },
        8800usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AuthenticationLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AllowedTlsCiphers as *const _ as usize },
        8808usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AllowedTlsCiphers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).VmConnectMode as *const _ as usize },
        8816usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(VmConnectMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).NtlmSamFile as *const _ as usize },
        8824usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NtlmSamFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).FIPSMode as *const _ as usize },
        8832usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(FIPSMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).TlsSecLevel as *const _ as usize },
        8840usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(TlsSecLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1152 as *const _ as usize },
        8848usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1152)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MstscCookieMode as *const _ as usize },
        9216usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MstscCookieMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CookieMaxLength as *const _ as usize },
        9224usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CookieMaxLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PreconnectionId as *const _ as usize },
        9232usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PreconnectionId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PreconnectionBlob as *const _ as usize },
        9240usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PreconnectionBlob)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).SendPreconnectionPdu as *const _ as usize
        },
        9248usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SendPreconnectionPdu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1216 as *const _ as usize },
        9256usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1216)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RedirectionFlags as *const _ as usize },
        9728usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).TargetNetAddress as *const _ as usize },
        9736usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(TargetNetAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).LoadBalanceInfo as *const _ as usize },
        9744usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LoadBalanceInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).LoadBalanceInfoLength as *const _ as usize
        },
        9752usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LoadBalanceInfoLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionUsername as *const _ as usize
        },
        9760usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionUsername)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RedirectionDomain as *const _ as usize },
        9768usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionDomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionPassword as *const _ as usize
        },
        9776usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionPassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionPasswordLength as *const _ as usize
        },
        9784usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionPasswordLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionTargetFQDN as *const _ as usize
        },
        9792usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionTargetFQDN)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionTargetNetBiosName as *const _
                as usize
        },
        9800usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionTargetNetBiosName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RedirectionTsvUrl as *const _ as usize },
        9808usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionTsvUrl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionTsvUrlLength as *const _ as usize
        },
        9816usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionTsvUrlLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).TargetNetAddressCount as *const _ as usize
        },
        9824usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(TargetNetAddressCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).TargetNetAddresses as *const _ as usize },
        9832usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(TargetNetAddresses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).TargetNetPorts as *const _ as usize },
        9840usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(TargetNetPorts)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionAcceptedCert as *const _ as usize
        },
        9848usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionAcceptedCert)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionAcceptedCertLength as *const _
                as usize
        },
        9856usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionAcceptedCertLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RedirectionPreferType as *const _ as usize
        },
        9864usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RedirectionPreferType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1280 as *const _ as usize },
        9872usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1280)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Password51 as *const _ as usize },
        10240usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Password51)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Password51Length as *const _ as usize },
        10248usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Password51Length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SmartcardLogon as *const _ as usize },
        10256usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SmartcardLogon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).PromptForCredentials as *const _ as usize
        },
        10264usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PromptForCredentials)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1344 as *const _ as usize },
        10272usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1344)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KerberosKdc as *const _ as usize },
        10752usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KerberosKdc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KerberosRealm as *const _ as usize },
        10760usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KerberosRealm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1408 as *const _ as usize },
        10768usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1408)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).IgnoreCertificate as *const _ as usize },
        11264usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(IgnoreCertificate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CertificateName as *const _ as usize },
        11272usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CertificateName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CertificateFile as *const _ as usize },
        11280usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CertificateFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PrivateKeyFile as *const _ as usize },
        11288usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PrivateKeyFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RdpKeyFile as *const _ as usize },
        11296usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RdpKeyFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RdpServerRsaKey as *const _ as usize },
        11304usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RdpServerRsaKey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RdpServerCertificate as *const _ as usize
        },
        11312usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RdpServerCertificate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ExternalCertificateManagement as *const _
                as usize
        },
        11320usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ExternalCertificateManagement)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CertificateContent as *const _ as usize },
        11328usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CertificateContent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PrivateKeyContent as *const _ as usize },
        11336usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PrivateKeyContent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RdpKeyContent as *const _ as usize },
        11344usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RdpKeyContent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AutoAcceptCertificate as *const _ as usize
        },
        11352usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AutoAcceptCertificate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AutoDenyCertificate as *const _ as usize
        },
        11360usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AutoDenyCertificate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).CertificateAcceptedFingerprints as *const _
                as usize
        },
        11368usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CertificateAcceptedFingerprints)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1472 as *const _ as usize },
        11376usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1472)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1536 as *const _ as usize },
        11776usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1536)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Workarea as *const _ as usize },
        12288usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Workarea)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Fullscreen as *const _ as usize },
        12296usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Fullscreen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PercentScreen as *const _ as usize },
        12304usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PercentScreen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GrabKeyboard as *const _ as usize },
        12312usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GrabKeyboard)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).Decorations as *const _ as usize },
        12320usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(Decorations)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MouseMotion as *const _ as usize },
        12328usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MouseMotion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).WindowTitle as *const _ as usize },
        12336usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(WindowTitle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ParentWindowId as *const _ as usize },
        12344usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ParentWindowId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AsyncInput as *const _ as usize },
        12352usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AsyncInput)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AsyncUpdate as *const _ as usize },
        12360usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AsyncUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AsyncChannels as *const _ as usize },
        12368usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AsyncChannels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1548 as *const _ as usize },
        12376usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1548)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ToggleFullscreen as *const _ as usize },
        12384usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ToggleFullscreen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).WmClass as *const _ as usize },
        12392usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(WmClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).EmbeddedWindow as *const _ as usize },
        12400usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(EmbeddedWindow)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SmartSizing as *const _ as usize },
        12408usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SmartSizing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).XPan as *const _ as usize },
        12416usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(XPan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).YPan as *const _ as usize },
        12424usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(YPan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SmartSizingWidth as *const _ as usize },
        12432usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SmartSizingWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SmartSizingHeight as *const _ as usize },
        12440usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SmartSizingHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).PercentScreenUseWidth as *const _ as usize
        },
        12448usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PercentScreenUseWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).PercentScreenUseHeight as *const _ as usize
        },
        12456usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PercentScreenUseHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DynamicResolutionUpdate as *const _ as usize
        },
        12464usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DynamicResolutionUpdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1601 as *const _ as usize },
        12472usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1601)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SoftwareGdi as *const _ as usize },
        12808usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SoftwareGdi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).LocalConnection as *const _ as usize },
        12816usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LocalConnection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AuthenticationOnly as *const _ as usize },
        12824usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AuthenticationOnly)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).CredentialsFromStdin as *const _ as usize
        },
        12832usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CredentialsFromStdin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).UnmapButtons as *const _ as usize },
        12840usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(UnmapButtons)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).OldLicenseBehaviour as *const _ as usize
        },
        12848usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OldLicenseBehaviour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1664 as *const _ as usize },
        12856usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1664)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ComputerName as *const _ as usize },
        13312usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ComputerName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1728 as *const _ as usize },
        13320usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1728)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ConnectionFile as *const _ as usize },
        13824usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ConnectionFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).AssistanceFile as *const _ as usize },
        13832usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AssistanceFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1792 as *const _ as usize },
        13840usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1792)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).HomePath as *const _ as usize },
        14336usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(HomePath)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ConfigPath as *const _ as usize },
        14344usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ConfigPath)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).CurrentPath as *const _ as usize },
        14352usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(CurrentPath)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1856 as *const _ as usize },
        14360usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1856)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DumpRemoteFx as *const _ as usize },
        14848usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DumpRemoteFx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PlayRemoteFx as *const _ as usize },
        14856usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PlayRemoteFx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DumpRemoteFxFile as *const _ as usize },
        14864usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DumpRemoteFxFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PlayRemoteFxFile as *const _ as usize },
        14872usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PlayRemoteFxFile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1920 as *const _ as usize },
        14880usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1920)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding1984 as *const _ as usize },
        15360usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding1984)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayUsageMethod as *const _ as usize },
        15872usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayUsageMethod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayPort as *const _ as usize },
        15880usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayPort)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayHostname as *const _ as usize },
        15888usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayHostname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayUsername as *const _ as usize },
        15896usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayUsername)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayPassword as *const _ as usize },
        15904usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayPassword)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayDomain as *const _ as usize },
        15912usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayDomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayCredentialsSource as *const _ as usize
        },
        15920usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayCredentialsSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayUseSameCredentials as *const _ as usize
        },
        15928usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayUseSameCredentials)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayEnabled as *const _ as usize },
        15936usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayBypassLocal as *const _ as usize },
        15944usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayBypassLocal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayRpcTransport as *const _ as usize
        },
        15952usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayRpcTransport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayHttpTransport as *const _ as usize
        },
        15960usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayHttpTransport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayUdpTransport as *const _ as usize
        },
        15968usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayUdpTransport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GatewayAccessToken as *const _ as usize },
        15976usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayAccessToken)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayAcceptedCert as *const _ as usize
        },
        15984usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayAcceptedCert)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayAcceptedCertLength as *const _ as usize
        },
        15992usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayAcceptedCertLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).GatewayHttpUseWebsockets as *const _ as usize
        },
        16000usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GatewayHttpUseWebsockets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2015 as *const _ as usize },
        16008usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2015)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ProxyType as *const _ as usize },
        16120usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ProxyType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ProxyHostname as *const _ as usize },
        16128usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ProxyHostname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ProxyPort as *const _ as usize },
        16136usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ProxyPort)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ProxyUsername as *const _ as usize },
        16144usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ProxyUsername)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ProxyPassword as *const _ as usize },
        16152usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ProxyPassword)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2112 as *const _ as usize },
        16160usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2112)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationMode as *const _ as usize
        },
        16896usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationName as *const _ as usize
        },
        16904usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationIcon as *const _ as usize
        },
        16912usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationIcon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationProgram as *const _ as usize
        },
        16920usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationProgram)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationFile as *const _ as usize
        },
        16928usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationFile)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationGuid as *const _ as usize
        },
        16936usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationGuid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationCmdLine as *const _ as usize
        },
        16944usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationCmdLine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationExpandCmdLine as *const _
                as usize
        },
        16952usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationExpandCmdLine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationExpandWorkingDir as *const _
                as usize
        },
        16960usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationExpandWorkingDir)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DisableRemoteAppCapsCheck as *const _ as usize
        },
        16968usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DisableRemoteAppCapsCheck)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAppNumIconCaches as *const _ as usize
        },
        16976usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAppNumIconCaches)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAppNumIconCacheEntries as *const _
                as usize
        },
        16984usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAppNumIconCacheEntries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteAppLanguageBarSupported as *const _
                as usize
        },
        16992usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteAppLanguageBarSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteWndSupportLevel as *const _ as usize
        },
        17000usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteWndSupportLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationSupportLevel as *const _
                as usize
        },
        17008usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationSupportLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationSupportMask as *const _
                as usize
        },
        17016usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationSupportMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).RemoteApplicationWorkingDir as *const _
                as usize
        },
        17024usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RemoteApplicationWorkingDir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2176 as *const _ as usize },
        17032usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2176)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2240 as *const _ as usize },
        17408usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2240)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ReceivedCapabilities as *const _ as usize
        },
        17920usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ReceivedCapabilities)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).ReceivedCapabilitiesSize as *const _ as usize
        },
        17928usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ReceivedCapabilitiesSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2304 as *const _ as usize },
        17936usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2304)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).OsMajorType as *const _ as usize },
        18432usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OsMajorType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).OsMinorType as *const _ as usize },
        18440usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OsMinorType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).RefreshRect as *const _ as usize },
        18448usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(RefreshRect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SuppressOutput as *const _ as usize },
        18456usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SuppressOutput)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).FastPathOutput as *const _ as usize },
        18464usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(FastPathOutput)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SaltedChecksum as *const _ as usize },
        18472usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SaltedChecksum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).LongCredentialsSupported as *const _ as usize
        },
        18480usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(LongCredentialsSupported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).NoBitmapCompressionHeader as *const _ as usize
        },
        18488usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(NoBitmapCompressionHeader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).BitmapCompressionDisabled as *const _ as usize
        },
        18496usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCompressionDisabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2368 as *const _ as usize },
        18504usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2368)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DesktopResize as *const _ as usize },
        18944usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DesktopResize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DrawAllowDynamicColorFidelity as *const _
                as usize
        },
        18952usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DrawAllowDynamicColorFidelity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).DrawAllowColorSubsampling as *const _ as usize
        },
        18960usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DrawAllowColorSubsampling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).DrawAllowSkipAlpha as *const _ as usize },
        18968usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(DrawAllowSkipAlpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2432 as *const _ as usize },
        18976usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2432)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).OrderSupport as *const _ as usize },
        19456usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OrderSupport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).BitmapCacheV3Enabled as *const _ as usize
        },
        19464usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCacheV3Enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AltSecFrameMarkerSupport as *const _ as usize
        },
        19472usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AltSecFrameMarkerSupport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AllowUnanouncedOrdersFromServer as *const _
                as usize
        },
        19480usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AllowUnanouncedOrdersFromServer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2497 as *const _ as usize },
        19488usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2497)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).BitmapCacheEnabled as *const _ as usize },
        19976usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCacheEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).BitmapCacheVersion as *const _ as usize },
        19984usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCacheVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).AllowCacheWaitingList as *const _ as usize
        },
        19992usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(AllowCacheWaitingList)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).BitmapCachePersistEnabled as *const _ as usize
        },
        20000usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCachePersistEnabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).BitmapCacheV2NumCells as *const _ as usize
        },
        20008usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCacheV2NumCells)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).BitmapCacheV2CellInfo as *const _ as usize
        },
        20016usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BitmapCacheV2CellInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2560 as *const _ as usize },
        20024usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2560)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ColorPointerFlag as *const _ as usize },
        20480usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ColorPointerFlag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).PointerCacheSize as *const _ as usize },
        20488usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(PointerCacheSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2624 as *const _ as usize },
        20496usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2624)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).KeyboardRemappingList as *const _ as usize
        },
        20976usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardRemappingList)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KeyboardCodePage as *const _ as usize },
        20984usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardCodePage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KeyboardLayout as *const _ as usize },
        20992usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardLayout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KeyboardType as *const _ as usize },
        21000usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KeyboardSubType as *const _ as usize },
        21008usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardSubType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).KeyboardFunctionKey as *const _ as usize
        },
        21016usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardFunctionKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).ImeFileName as *const _ as usize },
        21024usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(ImeFileName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).UnicodeInput as *const _ as usize },
        21032usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(UnicodeInput)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).FastPathInput as *const _ as usize },
        21040usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(FastPathInput)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MultiTouchInput as *const _ as usize },
        21048usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MultiTouchInput)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).MultiTouchGestures as *const _ as usize },
        21056usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MultiTouchGestures)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).KeyboardHook as *const _ as usize },
        21064usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(KeyboardHook)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).HasHorizontalWheel as *const _ as usize },
        21072usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(HasHorizontalWheel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).HasExtendedMouseEvent as *const _ as usize
        },
        21080usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(HasExtendedMouseEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2688 as *const _ as usize },
        21088usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2688)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).BrushSupportLevel as *const _ as usize },
        21504usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(BrushSupportLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2752 as *const _ as usize },
        21512usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2752)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GlyphSupportLevel as *const _ as usize },
        22016usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GlyphSupportLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).GlyphCache as *const _ as usize },
        22024usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(GlyphCache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).FragCache as *const _ as usize },
        22032usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(FragCache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2816 as *const _ as usize },
        22040usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2816)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).OffscreenSupportLevel as *const _ as usize
        },
        22528usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OffscreenSupportLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).OffscreenCacheSize as *const _ as usize },
        22536usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OffscreenCacheSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).OffscreenCacheEntries as *const _ as usize
        },
        22544usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(OffscreenCacheEntries)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2880 as *const _ as usize },
        22552usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2880)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).VirtualChannelCompressionFlags as *const _
                as usize
        },
        23040usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(VirtualChannelCompressionFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).VirtualChannelChunkSize as *const _ as usize
        },
        23048usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(VirtualChannelChunkSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding2944 as *const _ as usize },
        23056usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding2944)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).SoundBeepsEnabled as *const _ as usize },
        23552usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(SoundBeepsEnabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3008 as *const _ as usize },
        23560usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3008)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3072 as *const _ as usize },
        24064usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3072)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3136 as *const _ as usize },
        24576usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3136)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3200 as *const _ as usize },
        25088usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3200)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3264 as *const _ as usize },
        25600usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3264)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3328 as *const _ as usize },
        26112usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3328)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<rdp_settings>())).MultifragMaxRequestSize as *const _ as usize
        },
        26624usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(MultifragMaxRequestSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rdp_settings>())).padding3392 as *const _ as usize },
        26632usize,
        concat!(
            "Offset of field: ",
            stringify!(rdp_settings),
            "::",
            stringify!(padding3392)
        )
